{"videoId":"CQsWgoQBtZs","title":"Stock Market Selloff DEEPENS","transcript":"I ask that you recall\nliberation day, the day that President\nTrump announced tariffs.\n>> That you recall\n>> Well, well, we got good old nonsense\ndrama talking going on. There Scott\nBesson testifying. Who cares? It's\nhonestly, it's a bunch of crap. It's the\nsame thing every time. These these\ncongressmen and women, they go in there\nand they read scripts from the industry.\nyou know, they're they're basically uh\nfunding groups and they go in there and\nthey read scripts based on the funding\ngroups that donate money to them and uh\nyeah, it's a stupid clown show. I I\ncan't stand it. Uh they call me jaded,\nbut uh yeah, I think it's a waste of\ntime, honestly. Uh in the meantime uh\nthis morning\nin the uh alpha report uh we uh we\ntalked about uh the um uh AMD uh and we\nalso touched on uh oops somebody says\nthere was a little oopsy dupy on uh on\non the YouTube post. Okay, hold on. Let\nme just make sure here I want to cuz I\nwant to break down what uh what the\nvision is for today. Give me a second\nhere. DJT,\nthat was his announcement on Truth\nSocial.\n>> And in so doing,\nTruth Social.\n>> No. Okay. Yeah, we're live on YouTube.\nOkay. Yeah. One person's like, \"Oh,\nyou're not live on YouTube.\" I should be\nlive on YouTube. All right. Anyway,\nwe're good. All is good. Okay. So, yeah.\nI mean, here was here was the playbyplay\nthis morning. And I just I give this to\nyou because I I you know I recognize not\neverybody is a member of the uh alpha\nmembership uh that you can get over at\nmeet.com. Uh but I want to give it to\nyou just so you can kind of see what\nthings I'm looking for. Uh and you know\nit's after the fact uh now for for those\nof you not in it but I always think hey\nif I can provide value and try to teach\nuh why not? So my my thesis this morning\nwas the tell of the direction of the\nmarket today would be almost entirely\ndependent not on the momentum that we're\nseeing at Nphase which is good that's\ngreat momentum for Nphase it has its own\nups and downs uh but instead what would\nhappen at open uh on AMD and\nunfortunately AMD was down uh 9% at open\nit is now down 15.6% 6%. Uh and to me\nthe uh indicator to watch uh at open\nthis morning was if AMD goes down that\nmeans institutions are not buying the\ndip. If anything they're selling and it\nis really bad for the entire stack. It's\na bad omen and it means the cues are\ngoing down. We were at 617 this morning.\nWe're almost lineto line from pre-market\n617 now almost down to 607. In addition\nto that, you're seeing the software\nselloff deepen with an 11.3%\ndecline on Palunteer. uh which that then\nalso uh uh reported this morning that uh\nyou had this risk of a reversal in\nSanDisk uh just because this whole stack\nis going right and and really the way to\nlook at the stack is memory is and I'm\nnot trying to bag on memory and these\ncompanies are making money handover fist\nbut memory is one of the last components\nuh of the artificial intelligence cycle\nand Unfortunately,\nthat that means there's probably a bad\nomen coming for memory over the next uh\nyou know, few weeks to to months. Uh and\nso I've been advocating for trailing\nstops on memory. Uh that's not to be\nbearish on the underlying industries. Uh\nand certainly we're seeing a broad\nsell-off uh not just in um you know,\nSanDisk today, but also this\ncontinuation of a selloff in in software\nstocks. Look at for example uh Service\nNow is actually only down about a half%.\nLooks like it recovered a little bit\nfrom the pain this morning. Got all the\nway down to about 104. It actually\nrecovered about 4% there. Somebody went\nin and bought the dip. Let's go look at\nuh Salesforce. Salesforce also look at\nthat. And this morning you had a\ncontinuation of the software selloff.\nYou had a little bit of a recovery here.\nUh let's get uh into it as well in here.\nYeah, look at that. Very interesting.\nRight around 10:00. So about 30 minutes\nafter the open. little bit of a reversal\non software with the exception of\nPalanteer, but really the play today was\nwatching AMD uh and then uh projecting\nthe Q's direction after uh AMD. We're\nnow right at 607, which is, you know,\nnot ideal. We are uh really seeing the\nweight of the artificial intelligence\nand private credit squeeze spilling over\nto to a lot of different names. uh\nyou're not only seeing it spill over the\nsort of private credit liquidity crunch,\nbut as a result of that, you're seeing\nless liquidity available for crypto,\nwhich is then hitting companies like\nRobin Hood. Uh and because Robin Hood's\ngoing down, now SoFi seems to be going\ndown, it's a little bit messy. Now\nsomething we we mentioned as well uh\nregularly and we talk about this is that\nwhen you have a broader stock market\nsellown you you risk company executives\nsaying well I guess that means we need\nto conduct layoffs. So uh that's not\nideal.\nSpaceX uh really needs to hurry up and\nIPO uh and who knows maybe we'll be\nthrough this this drama by the time\nSpaceX IPOs. But uh I mean look at this.\nI mean Robin Hood is is coming up on a\n50% decline in value. Uh Nvidia is still\nsitting in its sideways range. PayPal\nwon't stop bleeding. Uh Tesla, you know,\npeaked out around 500 bucks uh on uh uh\nyou know this this robo taxi uh\nexcitement around Christmas. But look at\nthese hardware stocks. Here's just can't\nget back. You're up. You're down 16%\ntoday. Uh so you've now retraced about\n40% over here. Uh corewave also can't\nmake it to new all-time highs. Not a\nsurprise to me that this one's trending\nback to our support line at zero. We've\ngot all five over here. Uh I think this\none's it's my opinion. I could be wrong,\nbut my belief is that this company is a\nscam. Uh a micro uh strategy\nunfortunately has also just hit its uh\nall-time low over here. Uh, well, I\nshould say not all-time low, but its\nlowest level since um all-time low over\nthe last year is the more appropriate\nway to put it. You basically fully\nU-turned all of the enthusiasm for it.\nUh, and you're now sitting at 2024\npricing. Uh, and uh, unfortunately, the\nnext stop on our line chart is 39, which\nwould bring you to about the lows that\nyou saw at the beginning of 2024. So\nwithin that one year time span over here\nuh actually about 9 months you actually\nsaw it rise from about 39 to that 120\nlevel. It looks like we're going\nfullport U-turn over here. Pretty\ndepressing for the market overall. Apple\nthough for those uh concentrated into\nApple doing doing quite decently here.\nuh people kind of seeing Apple as\ninsulated from ironically all of the art\nartificial intelligence spending that\npeople so long bagged on them for. Uh\nquite remarkable.\nNow uh you know another thing uh to to\nkeep in mind is a lot of these these uh\nstock selloffs are being driven by this\nbelief that oh you know software is all\ngoing to get replaced or creativity is\nall going to get replaced by artificial\nintelligence. That's quite a bullish\noutlook for artificial intelligence that\nI I heavily disagree with. I talked\nabout this a little bit this morning uh\njust briefly in the uh course member\nlive, but I it was really just as a way\nto sort of explain or or or teach. It's\nthis isn't meant to be a pitch. Uh but\nwhat we're seeing with artificial\nintelligence is we think there is a\nplateau and we think that a lot of\npeople are waiting because they think\nwhat's the point of developing our own\nmachine learning technology? What's the\npoint if artificial intelligence is\ngoing to go to artificial general\nintelligence? And based on what we're\nseeing, we don't think AGI is coming,\nnot anytime soon. We think what we have\nare really good tools of AI and and so\nwe can use those AI to create features\nand functions that haven't previously\nexisted by training our own machine\nlearning. So the reason I you know I I\njust use house hack as an example is\nbecause I believe that a lot of this\nselloff in software is overdone. The\nproblem is when you get these sort of\nsell-offs in software, Bloom Energy is\nstill actually holding up. Uh when you\nget these sell-offs in software, you you\nrisk leading to layoffs. Uh which is the\nworst case scenario because we don't\nhave the we don't have room for layoffs.\nJust to make sure I don't get in trouble\nwith the SEC, remember, yes, we do have\na fund raise open for uh Reinvest. It\ndoes close on February 6th. Uh and uh\nthis video is not a solicitation. You\ncan always click the offering circular\nbutton here takes you right to it. Or if\nyou click invest, you could also click\nthe offering circular right here. It\ngives you the details. 5% yield through\nconversion. Real estate backed invest\nwith credit card. AC wires no fees.\nInvestment round closes Friday. Okay, we\nalready know all that. So, um\nlet's go take a look here at uh the ADP\nreport this morning.\nUh let's go.\nADP ADP ADP\nADP ADP ADP ADP.\nOh, Cody, the course live. Oh, okay.\nI I can fix that. We'll take a quick\npeek there. And then what we're going to\ndo is we're going to grab the um what's\nit called?\nWe're going to grab this ADP report and\nsee what's going on there. But let me\nsee if I made a little whoopsy doopsies.\nIt's possible. Let's listen to Besson\njust for a moment here while I figure\nthis out. Time is expired. I recognize\nthe ranking member of our housing and\ninsurance subcommittee, Mr. Clever of\nMissouri. You're recognized for five\nminutes.\n>> Thank you, Mr. Chairman.\nUm,\nunfortunately, uh,\nthis is um,\nan embarrassing kind of a\nhearing. I I've been on this committee\n20 21 years. We've had all kinds of\nconflict. In fact, I was in here when\n>> I don't really care. I don't want to\nhear this. Uh, okay. Good.\nSo, um, somebody here says BTC is no dou\nnos diving. Yikes. Yeah, you know, it's,\nuh, and somebody else says not. So, what\nOh, it is it with the technology today.\nShould be streaming on X. It says, uh,\nwe've got that indicated up. Let me try\nhere. Ah, yeah, there we go. Thank you\nfor that. I appreciate that. All right.\nVery well. So, uh, all those little\ntechnical glitches have now been solved.\nNow, we should be live on X and, uh,\nalso, yeah, there we go. And also\nYouTube, everything's fine. Okay,\nperfect. So, let's go ahead and look at\nthe press release here on the ADP\nreport. Unfortunately, the ADP report\nwas not great. Uh, this is the ADP\nreport for January. Uh the data trend\nhas been\nthat we were looking for about a 48,000\njob gain. Uh unfortunately what we got\nthis morning was actually 22,000.\nUh which wasn't great. Uh so we saw a\nlittle bit of a slower than expected\nrate here. It's still positive, but it\nreiterates to us how little room or\ncapacity we have for layoffs. you know,\nmassive decline in private jobs in 2025.\nPrivate employers adding about 400,000\njobs, down from 771.\nWe've seen a continuous and dramatic\nslowdown in job creation uh and wage\ngrowth has been stable.\nNow uh where we could see uh you know\nmost of these are plus or minus zero but\nwhere we see the largest pain is\nactually right here in business services\nand professional which is exactly\nuh where the AI fear is. All right. This\nis exactly where the artificial\nintelligence um fear is. And what's\noffsetting it is mostly healthcare. Uh\nhealthcare and education added the\nlargest right here at 74,000. So if it\nwasn't for these sort of more lagging\nindustries, uh we'd really have a\nproblem. Uh you could see here. Yeah. Uh\nlet's see here. These were the regions,\neducation, health services. So they\ndon't break those out unfortunately. I\nwas hoping that they'd break those out,\nbut it doesn't look like it. Education,\nhealth was stand out. Yeah. No, they\ndon't. Okay. Uh, and then it's pretty\nbroad base, though. Uh, you know, you've\ngot 17,000 jobs in the Northeast, minus\n11 over here, - 10 over here, 25 over\nhere. So, it's not like one region is\nreally seeing the big swing. Although, I\nwill say the South Atlantic number is\npretty wild right here. Negative\nnegative 76,000. That's pretty\naggressive. uh and uh interestingly it\nyou know small establishments added zero\nis actually the largest of companies\nthat had a net negative result on\npayroll.\nSo that could be Amazon for example who\nis an ADP customer. So not ideal. This\nthis did add a little bit of weight to\nthe downside for um\nuh the broader market unfortunately. So,\nuh, if we take a peek at, uh, let's see\nhere, where are the Q's sitting today?\nQ's still down about 1.24. Look at that\nperfect bounce there at 607. It's\nactually positive, uh, to see that, uh,\nbounce right here. Getting a little bit\nof a recovery over here on SanDisk as\nwell. Oracle, yeah, still leaking\nunfortunately. How's Disney doing?\nDisney's trying to recover a little bit.\nLook at that. Coming up from about 103\nafter its earnings.\nOkay, let's go see what is actually news\nout there. So,\nlet's find out.\nAll right, so the information Amazon\ndiscusses getting special access to\nOpenAI tech as Amazon weighs an equity\ninvestment of tens of billions of\ndollars. The companies are also\ndiscussing a commercial agreement that\ncould require OpenAI to dedicate its own\nresearchers to developing Amazon\nproducts. Oh, wow. That's actually very\ninteresting because what it what it sort\nof indicates\nuh is that in order to get money, these\ncompanies are becoming more demanding,\nright? Uh if if everybody so desperately\nwanted to get in on artificial\nintelligence,\nthen you wouldn't really have the right\nto make demands. So, I actually see that\nas somewhat of a uh red flag on that\nOpenA fund raise. So, OpenAI fund raise\nred flag.\nLet's write it down. uh OpenAI\nor uh Amazon Amazon possibly requiring\nuh OpenAI\nhelp customize and develop\nAmazon's own AI products in exchange for\nan investment.\nUh\nagain, this\nlet's write that down.\num if people were uh climbing over each\nother\nfor access to OpenAI shares at this\nvaluation,\nAmazon would not be able to make these\ndemands.\nKind of useful to pay attention to. Uh\nwhat else here? Amazon could customize\nits voice assistant features. We're\nfocused on a strong partnership. This is\nmore like a contract than an investment,\nright? Uh sounds like an um a you know\nsort of a contractor\nrelationship, you know, work agreement.\nSounds more like that than it sounds\nlike anything else. That's clear. Not\nclear how much of a discount Amazon\nwould get from OpenAI.\nDiscussion show the length of Open AI\nmay go to raise capital. Yeah, exactly.\nShows the length that OpenAI will go to\nraise capital. That's bearish.\nLet's see here. Some talk about\npotentially uh contributions of more\nthan $60 billion in a new funding round.\nOkay. Such a deal also help Amazon's\nefforts to offer consumers of business\nAI software that stands out in a crowded\nmarket, right?\nOr not. Okay, let's see here. here.\nAmazon employees have faced restrictions\non customizing models from Anthropic.\nMhm. Meanwhile, Amazon's efforts to\ncreate its own AI haven't lived up to\nexpectations. Pending this mega deal\nshows the two companies are interesting\nincreasingly mirroring the kind of\ncircular arrangement Microsoft and\nOpenAI forged at the start of the AI\nboom.\nUh, OpenAI is renting AI servers from\nAWS. Bigger rental agreement than with\nMicrosoft.\nopening eyes trying to get 100 billium\nchips. Two sides have discussed\npotential commercial partnership.\nAnthropics had restrictions blahy blahy\nblah. Yeah. None none of that rest\nreally matters. I think where the most\ninteresting there is, you know, like\nit's kind of like I mean, you know, just\njust for comparison sakes, I mean, we're\nnot anywhere in in their money raise\nlevels, but like I I look at this and\nand I think, okay, you know, just for,\nyou know, my my little startup, uh I\nlook at this and go, you know, I'm not\nI'm not having to offer people like, oh,\nhey, if you invest in in House Hack,\nwe'll uh we'll buy a bunch of your\nproduct, right? I've done that for\nnobody. And so, you know, we raised\n$15.1 million in 90 days for, you know,\nyou know, a little little real estate\nstartup, uh,\nyou know, through YouTube, which which I\nthink is really incredible. But like,\nyou know, if I had to start going, \"Hey,\nhey, yeah, uh in exchange for that, you\nknow, we'll uh we'll we'll buy all your\nhardware, we'll buy all your chips,\nwe'll give you a contract relationship\nwhere you could develop stuff for us or,\nyou know, whatever or I'll buy your home\nfrom you or whatever that um then all of\na sudden it sort of like it suggests,\nokay, well, isn't that then than then\nweaker in terms of uh you know, an\ninvestment mode?\" Uh that's my take. Um,\nanyway, ah, going right back down to 607\nthere. That bounce didn't last. Look at\nthat. Almost down 16% now on AMD. Yikes.\nUh, so anyway, I I thought that was that\nwas that's an interesting piece.\nSomebody says, \"Would you do an\ninterview with Michael Sailor?\" What's\nup, Max? Um, no. I I don't really have\nI I don't He would not like doing an\ninterview with me. Let's just put it\nthat way. Um,\nI would ask questions that that nobody's\nasked before and they would be quite\nuncomfortable and so I don't think it\nwould go anywhere. Uh, so I'll probably\nget kicked out or killed. Why big tech\ncompanies are racing to fund Open AI?\nWell, yeah, it's the big circle, right?\nI mean, I love the image right here,\nwhich they probably did with AI anyway.\nBut Nvidia can invest around 30, Amazon\ndown for 20, Microsoft looking at 10,\nSoft Bank will bring in money. colleague\nreported all of this, you know. Okay.\nInteresting. Current uh fund raise\nrumors.\nOkay. So,\nAmazon 20 bill, Nvidia\n30 bill\nand uh SoftBank 30 bill, Microsoft\n10 bill.\nuh this this could slow\nyou know these these are public uh so if\nthey get punished by investors these\ncommitments could slow uh absent other\njustifications like Amazon's\nuh you know justification above about oh\nwell hey you know they're going to\nthey're going to do special stuff for us\nso\nAll right, let's see here. Opening eyes\ncompanies by your schedule about the\nnumbers. More concerning reasons.\nUh, one is that OpenAI is facing growing\nskepticism from markets about its cash\nburn, future profitability. OpenAI has\neffectively funded its data center\nbuildup by leveraging its balance\nsheets. Uh, investors have signal\nthere's no limit to how much they'll\nlend to pay bills for the future, right?\nblah blah blah blah. I mean that all of\nthis works until it doesn't. And the way\nit doesn't is you just continue to get a\nsell off in Microsoft stock, for\nexample. And a sell off in Microsoft\nis\ngoing to punish them potentially for\nmore investments into OpenAI. I mean,\nthey're they're up 1% today, which is\nnice, but look at this. We're at 408. I\nmean from peak we've destroyed at\nMicrosoft\nuh 415\ndivided by 553 just destroyed 25% of\nvalue over here.\nSomebody says Google an arm cooked after\nthe bell day. Oh no the the\nforeshadowing the $2 foreshadowing.\nAh yeah very interesting. And then the\nQ's\nright at 607.\nAll right, let's keep going here.\nSee,\nso we saw this China's response\nblah blah blah. AWS data centers in\nspace are a long way off. Oh well, yeah,\nI totally agree with that. Venture\ncapital in the Epstein files.\nThis is interesting.\nreflects entertainment's decline. Let's\ntalk about that.\nThis, this, and this.\nAll right, let's see what we have here.\nSo, Nvidia's application to sell the\nH200 is still awaiting final approval\nfrom the government nearly 2 months\nafter Trump uh approved the sale. Ah,\nthat's interesting.\nJensen brokered the deal.\nAh, that's still on ice. Nvidia to China\ndeal on ice.\nUh,\nstill waiting for H200 export license.\nIt's been 2 months since Trump approved\nit,\nbut it needs formal approval. Well,\nthat's useful to know. All these deals\non ICE. Not great. Okay. What is this\nentertainment decline they're talking\nabout? Uh Disney's\nparks chief. Disney named parks chief.\nOh, the parks chief\nis taking over. Yeah, I didn't know what\nposition he had before.\nDisney's appointment reflects the fact\nthat it is now primarily a parks\nbusiness rather than an entertainment\ncompany. You might not realize that from\nthe Hollywood obsessed news coverage of\nDisney, but its financial performance\nproves it.\nIts experience segment of parks, cruise\nships, and consumer products generated\n$10 billion in operating income, while\nthe entertainment and sports generated\n7.6 billion. Wow. Yeah, no kidding. I\nmean, that's always been the joke at\nDisney that, you know, Disney takes the\nprofitable, high margin, pricing power,\nparks and cruises, and merchandise\nrevenue and blows it on making, you\nknow, streaming content. Uh, that's been\nthe uh the sort of joke.\nDisney experiences segment has grown\nsteadily as it opened new parks and\nexpanded its cruise ship business around\nthe world. And they they I mean they\nhave great quality honestly. I mean they\nhave the pricing power.\nUh\nover the past decade ESPN and the cable\nchannels have declined. Well that makes\nsense. Replaced by streaming, right?\nDisney's now making decent money in\nstreaming, but nowhere near enough to\noffset the loss in TV. Wow.\nWow.\nPayPal's board must be wishing Dan never\nleft. The company's revelation that the\nHP CEO would suddenly succeed.\nAlex puts the spotlight on the latter\nhiring and why Shman longtime CEO to\nleave in the first place. Blah blah\nblah. Okay. Yeah, whatever. All right.\nThese companies are lost for direction.\nAll right, AWS on space data centers.\nThe biggest pro, one of the biggest\nproblems, by the way, is cooling. And uh\nsomebody asked me, they're like, Kevin,\nwhat do you mean cooling? Like, isn't it\ncold in space?\nExcuse me.\nExcuse me. Uh it can actually be very\ncold or very hot in space. So, uh you\nknow, cooling cooling in space isn't as\nintuitive as we think. We think when we\nfly, it gets colder as we go up. But the\nproblem in space uh there's there's so\nmuch radiation uh and and obviously you\nknow variations based on where you're\norbiting uh it could get very hot uh and\nand very cold. The problem with cooling\nin space though is you don't have air\nflow. So you can't like use fans to cool\nGPUs. You have to cool them with with a\nliquid. Well, that's not that easy\neither because you need a liquid that\nhas to sustain\nat, you know, negative 140° which is\nvery cold and positive 140° which is\nvery hot. Uh, and then it still has to\nbe a functional product. So, a lot of uh\nuh people use a uh in space like you\nknow space station uses I believe it's\nlike an ammonia based um\nyou know solution that's exceptionally\ntoxic to humans. Like if you go service\nan ammonia line and you get some of it\non you and you take a whiff of it, it\ncould kill you uh like instantly. It\nit's it's very very bad and noxious the\nstuff that's used for space cooling. And\nyou know, I I I don't think we're as\nclose as people think just on a cooling\nbasis alone. So cooling is a substantial\nissue uh for space data centers. I I do\nthink that\nuh hold on. I think Lauren's calling me.\nUh oh.\nAll right.\nSo, space data centers uh to me I think\nyou know this this is this is just my\nopinion uh and I've said it in my space\ndata center video uh in my uh space data\ncenter video which I think I have that I\nthink I called it the space X uh SpaceX\ndata centers meet Kevin. Let me see if I\ncan link that video. Oh yeah yeah yeah.\nOkay, there it is. I posted it a month\nago in my space data center video.\nOkay, good. Um,\nthere we go. Um,\nuh, I I talked about how speculative,\nuh, data centers in space are and the\nchallenges, uh, including the physics of\ncooling in space, uh, how hard it is,\nright?\nUh,\nso I'm curious to see what the AWS staff\nsuggests.\nThe AWS staff.\nOkay. Uh,\nokay.\n>> One sec.\nOkay.\nOkay.\nSo, uh Okay.\nUh\nokay. So sorry about that. Uh AWS says\nexisting technology is pretty far from\nmaking space data centers possible. AWS\nuh current tech far from making space\ndata centers possible. And this sort of\nalign so far with what we we've studied.\nUh, I don't know if you've seen a rack\nof servers recently. They're heavy.\nUh, we have not built a permanent\nstructure in space on the moon or\nanywhere like that. I know Elon's going\nto launch a million satellites. There\nare not enough rockets to launch a\nmillion satellites yet. Uh, that's also\nkind of a good point. Uh,\nso\nyeah. No, no. Nvidia chips using normal\nwater on Earth is different than space.\nYou know, in space you you have\nsubstantially larger temperature\nextremes. You know, if you would just\nyour water lines would just freeze uh in\nthe cold of night. It just doesn't work.\nSo like trying to apply physically\ntrying to apply uh a technology that\nworks here on land to data centers in\nspace is is is Uh I mean that\nhere let me um I'm going to make a very\nlet's do this. Uh it was a 34minute sort\nof deep dive analysis into this. Uh,\nlet's I'm just going to\nchange the title here to just something\nblunt. We're going to call it SpaceX and\ndata um\nSpaceX data centers in space. Uh\nthere. All right. And I'm calling it\nscam or 10x. SpaceX data centers in\nspace. Stata centers. One word or two.\nHow's everybody writing it these days?\nTwo words. Good. All right. Let's see\nwhat else they say. Earlier this week,\nRocket Satellite Company announced\nthey'd be merging with XAI, blah blah\nblah. We know that. Bezos, who also\nfounded Blue Origin, says that uh said\nin last fall, data centers in space\ncould be built within the next 20 10 to\n20 years. See, I actually think that's a\nreasonable time frame. That's a very\nreasonable time frame.\nI think that's very reasonable.\nYeah. All right. Good. So, now let's see\nhere.\nWhat else do we have?\nOkay. We talked about that. We talked\nabout that. All right. Good news is, you\nknow, there's plenty of room in the\nUnited States even to build data\ncenters, which I'm pretty excited about\nbecause I think that these are all just\ngiant commodities and they're going to\nactually make the the final products\nlike the final winners of artificial\nintelligence, I think, will be the\ncompanies that provide really good value\nto people. Uh, obviously that's what\nwe're trying to build with with our\nhouse hack AI. uh you know, if we can\nnationwide cast a net and go, \"Hey, here\nare the best 20 houses to buy across the\nentire nation, right? That's like\ninstantly that's really valuable.\" Or\nthe best 1,000 homes to buy, whatever.\nYou could scale it to whatever level you\nwant. It's quite incredible. And it\ndoesn't require AI to get any better.\nYou know, it AI could stay at this level\nand it's totally fine.\nAll right. So, uh, Iran plays hard ball\nwith the US. That's not great. That\ncould become a whole another issue.\nWashington Post lays off onethird of its\nstaff. Is it in Bezos by the post?\nWashington Post is cutting onethird mass\nlayoffs in a broad strategic reset. Wow.\nWapo\npost lost 77 million in 2023 and 100\nmillion in 2024. Wow.\nThey're getting smoked.\nYeah. The papers owner, Jeff Bezos.\nYeah. Yeah.\nDeep gutting.\nMaybe it's because it's a a left-wing\nrag with little viewpoint diversity.\nFor years, I read op-ed section, you're\nracist, climate change, Trump is Hitler.\nRinse and repeat. I mean, I don't think\nyou should judge the Washington Post on\nthe uh opinion piece uh section. I mean,\nreally any paper, right? Uh I actually\nfind that they tend to get some decent\nscoops. You know, the fact that they're\nlosing money like that is obviously a\nbad sign, but but they can often\nactually get some pretty decent\nexclusive reporting.\nUh so,\nlet's take a look at this. Why nobody\nreally knows the scale of the US housing\ncrisis. Okay, let's take a look at this.\nUh, America faces a housing shortage.\nMoody says it will take 2 million homes\nto resolve that shortage, but Goldman\nput the number at 3 million. Zillow says\n4 million. Brookings projects 5 million\nand McKenzie 8 million. Congressional\nRepublicans insist it's 20 million.\nThere are other economists who contend\nthere's no shortage at all.\nUh, there are 146 million homes. Of\nthose 8.1 million are doubled up homes,\nmeaning people share space with non\nrelatives. It's an interesting phrase.\nUh this would be like roommates\nbasically. 3.4 million vacant homes\navailable to rent or buy. Well, but that\nthose could be homes in transition. I\nmean, because that's like 2%. You know,\nthat could just be properties in\ntransition to uh to being rented out. I\nmean, like when a home is under\nconstruction, it's going to be vacant,\nright? I mean, we just bought 12 and\nwhile we renovate them, they're under a\nconstruction and they're vacant, you\nknow, and then we rent them out and then\nfamilies can live in them where people\nweren't able to live in them before. So,\nyou know, that's that's providing\nhousing. Uh, let's see here.\nSeveral uh analyses zeroed in on two\nquestions. How many homes are vacant and\nhow many consumers have developed\nstriking out because of the cost? May\nseem counterintuitive. Blah blah blah.\nWhat constitutes healthy vacant levels?\nThis looks like what is this? Census\nBureau. What is this? Vacancy rate\ntumbled after the housing move ended.\nFine. Housing costs are prohibitive.\nPeople live with their families more,\nright? I mean, this this all skews the\ndata because if people aren't forming\nhouseholds, then you know, how do you\nactually figure out how many more homes\nthat you need? Point is,\nyou know, cities are really bad at at\ndelivering more housing. And that\nactually makes housing such a good\ninvestment because they like politicians\nreally suck at enabling housing. They\nthink what you should do is have rent\ncontrol which then reduces housing uh\nbuilding. They think that you should\nbuild affordable housing units. Well,\nthat then also reduces construction. So\nas usual, the government, you know,\ngenerates this real backwards math for\num\nuh and backwards incentive structure for\nyou know uh housing and housing\naffordability.\nAll right, what else? Uh most read Trump\nplans to install Christopher Columbus\nstatue outside the White House. Okay.\nAll right,\nwhatever. Let's get back to financial\nstuff.\nUS shoots down Iranian drone outside uh\nuh or outside the just outside of the\nairspace of a US aircraft carrier.\nReally? Look at this. This is a\nWashington Post piece. US forces shot\ndown an Iranian drone approaching the\naircraft carrier US Abraham Lincoln in\nthe Arabian Sea. Wow. The incident\noccurred about 500 miles from Iran's\nsouthern coast.\nSomebody says, \"Kevin, go check out\nApploven. What's going on with\nApploven?\" Oh, wow. Q's 60397.\nAMD now down 16.7. Well, like we said in\nthe alpha this morning, if AMD drops\neven in the first minute, it's a red\nflag for the Q's. And oh my gosh, it was\nit a red flag for the Q's.\nAlso, SanDisk, this trailing stops are\ngoing to start triggering. Just\naccelerate the down for people. Wow.\nSoFi down 6%. What's going on with\nApploven?\nApplovin 14%.\nWow. Off a cliff, huh? It's almost down\nhalf.\nThat's remarkable.\nOkay, what do we have here? So, this was\na Shaw 139. Oh, they've used this to go,\nyou know, bomb uh Israel or try to.\nActually, I think I have, if I go into\nmy search feature, I might actually have\na picture of it here. Do I? No.\nA\nOh.\nOh. Ah, here we go.\n136 131s. This was a 139. How\ninteresting. because these are the\ndrones that Iran, you know, likely\nmanufactures in uh\nuh or for export to Russia. See, Russia\nis working towards manufacturing a\nvariant of the Iranian drone which calls\nwhich is called the Guarant 2 to\nsupplement its dwindling stockpile. This\nis the 136, but they shot down a 139.\nIt's very interesting.\nYeah, here it is. Russia has Iranian\nshiad drones assembled in both Russia\nand Iran.\nLook at this. I I wrote this I wrote\nabout this back January 2024. They\nactually got a lot of data in here. Like\nquite useful. All right. What else?\nThat's all in the Me Kevin app, by the\nway, if you ever want to look at me\nKevin app.\nflying with unclear intent as it\napproached the carrier despite personnel\nusing unspecified deescalatory measures.\nYeah, how do you tell a drone to stand\ndown?\nAn F-35 fighter jet shot down the drone.\nThat's cool. An F-35.\nThat's awesome, man. I want to fly an\nF-35. That' be sick.\nBut I will not.\nAll right, what else do we have here?\nRussia spy spacecraft have intercepted\nkey European satellites. That's not\ngood. Reading the runes on war\nborders are removing 700 troops uh or\nICE agents rather from Minneapolis\nNova Nordisk\nuh Disney blah blah blah.\nBanks seek out new buyers for Oracle\ndata center lows. Here we go.\nHere we go.\nThat's what I want to see. Look at this.\nLet's go back to our AI news portion\nright here.\nOracle.\nAll right.\nOracle\nbank loans and financial times.\nLet's see what we got.\nBanks are tapping investors such as\ninsurance companies of private credit as\nthey try to find buyers for tens of\nbillions of dollars of loans tied to\nOracle data centers. Exactly. This this\nis why exactly why I keep saying that\nthe whole private credit slowdown isn't\nidiosyncratic. It affects everything.\nSo, you know, banks going to private\ncredit to bail out uh Oracle data center\nloans\nuh u okay banks are I'll say I'll say to\nme uh this\nis a red flag uh private credit is\nalready seeing money run for the exits\nuh on fears of fraud\nAI software exposure uh and uh poor\nperformance\nrelying\non private credit to uh buy out bank\nloans for data centers\nuh is um a bad omen in my opinion. Okay.\nAt least 56 billion dollars worth of\ndebt\nhave been given investment grade\nratings. Right. Right.\nWhile banks have mostly intended to fund\na project, finance loans for\nconstruction of toll roads airports\nthemselves, massive deal size of recent\ndata center projects have overwhelmed\nthis source of demand, leaving tech\ngiants key to keen to find new sources\nof capital. Right? We basically tapped\nevery single finance bank possible. But\nthere are only so many banks. Banks will\nhave to offload that risk if they want\nto keep lending. Wow.\nYeah. I mean, they're bluntly saying it.\nUh, you know, they're they're bluntly\ntelling you\nuh bluntly telling you they're running\nout of money.\nUh, which is bad because that affects\nthe entire cycle, right? You know, if if\nif\nnot Oh, okay. the founder of uh First\nBrands just plead not guilty to um\nfraud that just came through the wire.\nFirst Brands uh CEO just pled\npled not guilty to fraud.\nYeah, we'll see about that.\nOkay. Uh so\nlet's see here. Opens up a new pool of\ninstitutional. Right. So they slapped an\ninvestment grade label on it. Slapped\ninvestment grade rating. Well, that's\nokay.\nrating\non it to open up pension funds.\nOkay, that this sounds like 2008 all\nover again. 2000, you know, the the\nbooks on 2008 are writing themselves.\n2007, 2008.\nUh let's see here.\nWhat is that?\nMexico consulting on how price floors\ncould be included in agreements on\ntrade. US Mexico announced plan to\ndevelop coordinated trade policies.\nUS and EU will sign memorandum of\nunderstanding to boost critical mineral\nsupply blah blah blah blah blah. Okay.\nSomebody says, \"Shit is hitting the fan.\nI work as an engineer at a major auto\ncompany. We are cutting production and\nshifts. Manufacturing has been rough,\nespecially autos, you know, with with\nhow high rates have uh, you know, been.\nUh, it has uh it has definitely been\nbeen rough. Oh crap. Hold on. I got to\nmake a quick call. I totally forgot that\nI booked this for this time.\" Well, good\nthing I noticed it right now. Uh,\nactually make sure I actually get the\nphone call. Oh, I think they're going to\ncall me.\nOkay, cool. It hasn't come in yet. Uh,\nwell, when it does, we'll just\nlisten to some TV.\nUh, and then we'll comment on it. But\nanyway, I got to be alert for that.\nUh, anyway, uh, attempts to find buyers\nfor debt comes amid a rapid increase of\ndebt issuance by big tech companies.\nhalf of the largest\n10 buyers in the US investment grade\nbond market set to be so-called\nhyperscalers by 2030.\nInvestor concerns have been growing\nabout Oracle's aggressive commitments.\nRatings on data center loans cover\nOracle's leases on $ 38 billion of data\ncenters. We're talking about So, it's a\ntotal of $56 billion in this article\nreferenced uh in this article.\nHold on. You know what? Let me see if I\ncould just delay this like 30 minutes\nbecause they haven't called yet anyway.\nUh, let's see here.\nend. Okay, perfect. See if I can buy\nmyself a few minutes. Uh\noh, that's good news.\nUh\nhuh.\nOkay.\nOkay, cool. Good. All right, so let's go\nback to where we were.\nBoth loans are being marketed to\ninvestors rating down data center\nleases, right? Blue Owl credit rating.\nYeah, let's see how Blue Owl is doing\ntoday because I mean obviously\neverything's dumping hard today. Well,\nnot everything. Microsoft's up a\npercent. Wow, the Q's are almost down 2%\nagain, huh? Oh, trying to get back to\n607 here. Sand is still down 11%. But\nlet's look at Blue Owl.\nSee if I go Blue Owl.\nBlue Owl Technology. This is their fun.\nThey're actually up today. That's\ninteresting. Uh they've been coming down\nquite a bit. And then you could really\nsee that pain right here on Blue Owl.\nBoy, they've gotten hos. And then if I\ngo to Blue Owl\nuh Capital.\nOh, wow. That's the company.\nWait, Blue Owl Tech. Which one's which?\nNo, this is another fund as well. They\njust have so many. That's a BDC,\nBusiness Development Corporation. Blue\nOwl\nOwl.\nThere we go. This is the company. This\nis the private credit lender. You know,\nthey've come down from 2555 down to\nunder $12 now. So, more than have uh\ntheir BDC is has fallen off a cliff and\nso has Blue. These are the companies\nthat they like they can't get rid of\nthese loans anymore. So, they can't get\nrid of these loans. So, they're like,\n\"All right, well, let's slap an\ninstitutional rating and let's sell it\nto pensioners.\" Which honestly is like\nscary.\nWait, where did where did they say? Oh,\nhold on. Where was the pension part? I\nthought I saw them say pension up here.\nInvestment grade ratings allow banks to\nattract a broader\nI thought they said pension.\nNo, maybe they didn't.\nI guess not.\nI swear I saw it, but oh well. Uh, okay.\nIt opens up a new pool of institutional\nmoney that previously saw these assets\nas too risky. Right. Right. So slap a\nbetter rating on it to try to keep the\nPonzi going. I'm telling you the 2007\nbooks right themselves. Software company\nMonday raised separate $25 billion. We\nsaw that. We saw that credit rating has\nbeen extremely rare. While receiving a\ncredit rating during construction has\nbeen extremely rare in the data center\nspace, it's now becoming common. Right.\nGive everybody the rating, boys and\ngirls. Everybody gets a rating. You get\na rating. You get a rating. You get a\nrating.\nCrazy.\nUh, almost all large data center deals\nare trying to get a credit rating now.\nMore than a dozen banks have lent\nagainst Oracle's long-term lease\ncommitments, which are priced at 2 and a\nhalf over Sofur. It's actually not that\nterrible of a spread. Borrowing costs\nfor newer Oracle link data center\nprojects have widened 3 to four and a\nhalf. levels are closer to junk ratings,\nright?\nYes, I agree. Pricing uh the pricing of\ndebt has not yet been sold on to\ninvestors. Some investors are hesitating\nabout whether to purchase the two\nsyndicated loans\nin anticipation of higher returns.\nRight? So, they think that they're going\nto get better yields if they just wait.\nBanks are getting nervous. Banks are\nnervous about increasing their exposure\nto AI.\nSo they're trying to offer higher uh\ninterest rates. JP Morgan and MUFG which\nare leading the finance data center\nproject declined to comment. Of course\nthey did. Ah it's like yeah we are\ntrying to offload the bag man. The banks\nare trying to get out. Banks colluding\nwith a Yeah. Yeah. Yeah. What a line.\nLook at that. Banks colluding with\nrating agencies. Sounds like 2007 all\nover again. No kidding. Recommend.\nThat was a good one. In summary, the\ndebt is so large the banking system\ncan't handle it. I don't know about\nthat. It's ultimately but to do more.\nThey can't do more. Basically, it's\nultimately backed by a company with a\nnegative margin and competitors that are\novertaking. Yet, the bank is somehow\ninvestment grade or the rate the debt is\nsomehow investment grade. Right. Right.\nThat's that's the scam.\nUh,\nokay.\nLet me call him.\n>> It's been interesting. So, I was telling\nFrank, um, we like this part was just\nfor fun, but yesterday, just for fun, we\ntook we said, you know, here's a list of\nall the S&P 500 companies and loaded\nthem into, um, chat GPT and um, Claude\njust to see how the two would differ and\nsay, should this be an AI beneficiary or\nhurt by AI? And then the second question\nwe asked was, does Claude code benefit\nor hurt? No, there was a lot of self uh\nself-conlicted self-interest on the\nclaude responses on this on the cloud\ncode part, but there was so much um\nconflicting ambiguity even on the chat\nGPT and Claude side of it that it was\ninteresting to me that there was not\nconsensus. Now, we've been doing work on\nthese names for the last few weeks\ncompletely. And Liz, where I where I\nalso disagree a little bit is you're\nright. There's tremendous multiple\ncompression, but we still think there's\nnot enough multiple compression on many\nof them. So if you look at a data dog\nfor interest, for example, data dog\nseems like it should be a beneficiary\nfrom all of this. It has had multiple\ncompression. It still trades at like 300\ntimes earnings. Um or you take what is\nit like Palunteer is still at 100 and\nchange times earnings. Um who else was I\nlooking at? There's like another one\nthat's really compelling, but it's at 99\ntimes earnings. So even with multi\nmultiple compression there is not the\nmargin of safety broadly out there I\nthink to justify the pain and the\nambiguity that AI and quad code has\nintroduced in this space but again the\nresearch process is not going to be\nshort with these so you start it today\nI'm with you completely that there's\nopportunity\n>> I would just rather you know go on\nindividual stocks on that to you are you\nstarting to research looking for for\npossibly names to buy are you writing\noff this sector completely how are you\nviewing the broader space and the impact\nit's having on the broader market. Yeah,\nI mean for me Frank it almost feels like\na protracted deepseek moment that we had\nlast year where you know headlines are\nare are being developed last obviously\nyesterday was kind of this anthropic\nnews on on what what innovations are\nhappening in legal maybe you don't need\nuh counsel in certain respects to review\ncontracts we'll see u but for me\nsoftware to Jenny's point it still is\nexpensive right so it's still eight\ntimes sales of you know the software\ncomplex and I think you have to be\ndiscriminate in terms of what names\nyou're looking at um also to Liz's point\nI think it can go longer right I mean a\nlot of these a lot of these stories so\nit is for me potentially inching into\nthe story but I think the main point for\nme as I look at the traditional SAS\nmodel there could be some harmony with\nAI agents and the traditional SAS model\nwhere these these two um technologies\ncould work together in a productive way\nso yes there will be winners and losers\num but you just have to continue to pay\nattention I wouldn't be selling here.\nUm, but I potentially would be inching\nin going forward.\n>> All right. Uh, I want to move on to the\nchip space. Look at AMD. Shares pulling\nback quite a bit today. You can see\nthey're down more than 16%. Uh, the\nstreet saw the guidance is a bit soft.\nLisa Sue came on our air, talked a lot\nabout their AI server system, Helios in\nthe back half of the year, possibly\nbeing a big boost to the company. Joe,\nyou own this name. How did you view this\nreport? Do you think this is simply an\noverreaction? maybe fueled by some of\nthe weakness in software that seems to\nbe pushing this down or is it just the\nfact that it just wasn't good enough? I\n>> I don't think I I need to respond with a\na dramatic lengthy answer defending it.\nIt's it's fatigue. I mean, that's what\nit is. It's fatigue. It's pulling back.\nIt's had a significant move since April.\nIt's pulling back into the critical\nsupport of moving averages. It's going\nto remain in the ETF for us. It's been a\nstrong position and I think it depends\non where you've entered AMD. If you have\na degree of runway where you entered\ninto this in the second quarter or third\nquarter of 2025, you have more room to\nplay with where your exit ultimately may\nmay be. But unfortunately, if you were\nlate in this in the fourth quarter or at\nsome point more recently, you might be\nstaring at what is an unprofitable\ntrade. And you just have to manage the\nrisks surrounding that. and understand\nultimately that there is going to be\nexhaustion surrounding what has been\nsuch a compelling strong tailwind for\nmarkets over the last several years.\nThat powerful force dissipates at some\npoint doesn't go away. It just\ndissipates and I think this is a\nreflection of it. It needed to exceed\nthe wildest and strongest expectation\nand it did. All right.\n>> By the way, Wolf out with a note saying\nthey would use tech weakness to buy AI\nrelated semis. basically saying looking\nat this weakness because they feel like\nthat uh chips are unfairly being\npunished. Do you agree with that take\nwhen it comes to the chip space problem?\n>> Um I think in certain instances that\nthat applies. One name that that might\nwork towards is Texas Instruments. Texas\nInstruments, which we added to the\nportfolio recently. That's that's a\nlittle bit of an AI story, but that's\nmore about a recovery in autos. That's\nmore about a recovery in its core\nbusiness, which is analog chips. And\nagain, this isn't a stock that has rode\nalong with the tailwinds of the\nsemiconductor industry over the last\nseveral years. This is a stock that's\nhad a very strong rally up 40% from\nNovember. Why? Because it's seen the\nturn in the core business. You could\nsay, okay, it's an improvement of the\neconomy. Pick whatever reason you might\ncite for that, but it's industrial\nautomation. It's improvement in the auto\nindustry to a degree. It's AI, but\nthat's really where the strength is\ncoming from here.\n>> All right, Jason, you own Qualcomm.\nactually reporting later today with the\nidea of fatigue in the market right now\nimpacting AMD by you know by a lot\nshares down over 16%. How are you\nlooking at this upcoming earnings report\nand just this company in general\nactually trading higher going into its\nearnings up about one and three/4ers of\n1%. Yeah. So, they they had a downgrade\na couple weeks ago by Missou and it was\nreally kind of this story that I've\nwe've heard a lot about Qualcomm with\nkind of um Apple uh moving away from\ntheir business and obviously that they\nyou know $28 billion handset business uh\nfor for Qualcomm and that and 8 billion\nof that is Apple, right? So, so that is\na significant story. But I think the\nother thing for me is what has started\nto materially grow is IoT and and the\nauto business. And again, we probably\nneed those numbers to grow much faster\nthan they have over the last couple of\nquarters, even though they're growing at\nalmost a 30% clip. We're going to need\nto we need to really see those numbers\ncontinue to spike to potentially offset\nwhat that loss might look like for\nApple. And I think it is somewhat\noverblown. I think that's going to take\nsome more time. But, you know, listen,\nQualcomm has definitely underperformed\nuh the market and underperformed the\nsemis sector. So, um I'm going to we're\ngoing to need to see some catalyst there\nfor it to continue.\n>> We're looking at the broader chip space,\nLiz. Uh outside of memory where there's\na shortage and just heard announcement\ntoday from one of CEO saying there's\ngoing to be a shortage till 2028\nbasically. Um how do you view the other\nareas of the chip space? Cyclical\nsector. We've seen huge run-ups. AMD is\none example. Of course, Nvidia is\nanother one. How are you viewing this\nright now? Is this possibly the time in\nthe cycle to take some money off the\ntable or do you ride out this\nvolatility?\n>> Well, so first of all, to Joe's point of\nfatigue, yes, I think that's the case. I\nthink that's happening in the AI trade\nbroadly. I don't think that's just even\nhappening in the chip space. And the\nrotation that we've all been talking\nabout and that many of us have been\nhoping for. The money has to come from\nsomewhere. And a lot of the money has\ncome from the stocks that took us to the\npoint of highs in, you know, the big 10\nnames in the index, highs in all of\nthose AI darlings. Well, now we're\nseeing some of that come out, rotate\ninto other places. I think that's part\nof why we see the Dow as the only major\nindex that's up today. Traditionally, I\nwould look at the chip space versus\nsoftware and say it's a cyclicality\nsignal. Right now, we're seeing software\nhaving underperformed semiconductors by\n20%. Right? And and Jonathan Kinsky has\npointed this out just recently. There's\nsuch a widespread between the\nperformance of semis and software right\nnow that at some point there's got to be\nsome mean reversion just from a\ntechnical standpoint. Now that might\nmean that semiconductors have to come\ndown or it might mean that software has\nto bounce. Maybe a little bit of both. I\nthink semiconductors broadly speaking in\nthe AI trade will continue to be an okay\nplace to be. But if you're trading these\nnames and not investing in these names,\nthis is probably not the right time to\ndo that.\n>> Totally agree with what you said. The AI\nfatigue is not just isolated to\nsemiconductors. But I also think it's\ninteresting because if if you're sitting\nout there and you're looking at the\nmarket from a macro perspective and\nyou're the bear and you look at what has\nunfolded in the market, the correction\nin crypto, the correction in precious\nmetals, the significant precipitous\nuncll decline rather in software,\ntechnology kind of rolling over,\nmomentum rolling over right now. But\nguess what? The S&P 500 is still in a\npretty good place. And that really is\nthis really has not damaged the\nprevailing bull trend that's in place\nfor the year.\n>> I think we're about one and a half\npercent away from a new all-time high.\nSo still within striking. I mean it\ncould even happen today. Unlikely but it\ncould even happen today.\n>> It's the rotation is so dramatic this\nyear. And you know where my focus is.\nIt's always kind of more value old\neconomy. And you look at the Schwab high\nyield dividend index for ETF for\nexample. The ticker SCHD. It's up 13%\nfor the year. That's wild. Well, people\nare looking for safety, but it's\n>> like the dram the the dramaticness of\nthis rotation is to me quite powerful\nand extraordinary. Who knows if it lasts\npast the first quarter. I'm enjoying it\nnow. But it really is interesting.\n>> I think it's reflected in the elevated\nvolatility 19. If you're a hedge fund,\nif you're if you're a tactical trader,\nthis is great environment for you right\nnow. You're you're doing well.\n>> All right, speaking of that, we have two\nbig earnings reports coming up later.\nLiz, I'm just going to turn back over to\nyou. Um Amazon and Alphabet report this\nweek. two of the Mag 7, two\nhyperscalers. So, we're talking a lot\nabout fatigue. Could this possibly with\nall the drama we're talking about just\ncalm everybody down? If we get good\nreports from both of those, good growth\nin the cloud business and for Amazon\nalso some good growth when it comes to\nthe retail business.\n>> I think the story right now, first of\nall, the hyperscalers that have reported\nalready have announced increased capex.\nSo, capex is going to grow again this\nyear. I think it's in the high 30s%.\nThat's the expectation. So, that train\nhas not slowed down. We're continuing to\nspend. We're continuing to be optimistic\nabout how that spend might produce\nrevenue going forward. I think the story\nwill be and has already become a lot of\nthese companies that are established,\nthey have established customer bases\nbefore AI, before this whole story. Is\nthat established customer base going to\nbe as lucrative for AI as we go ahead?\nAnd part of it is cloud revenue has to\nmaintain its growth. It has to at least\nmaintain its strength. And depending on\nwhat the company is, I don't talk about\nspecific companies, but depending on\nwhere they found their their customer\nbase and how sturdy that customer base\nis, is there growth going on outside of\nsome of these stories of the moment? And\nwe saw what happened earlier this week,\nlast week, with some companies that\nweren't seeing as good cloud growth as\nas we expected. So, I think that ends up\nbeing the real lynch pin in this. But to\nyour question, will both of those calm\nall of these either or either? I I don't\nthink so. I because I think I don't\nthink it has to do with hearing bad\nresults out of the hyperscalers or good\nresults out of the hyperscalers. Does\nthat have an impact? Sure. But I don't\nthink that's what this software selloff\nis about. I think just generally\nspeaking, investors are looking for\nother places to find opportunity. And\neverybody got really skittish about\nvaluations. And when you get skittish\nabout valuations, you're looking for any\nopportunity, any excuse to say, \"Oh,\nthere it is. There's the big reason.\"\nAnd then you see some of the selling\nbeuette selling. And I think that's what\nwe're experiencing in some places.\n>> Jason, coming over to you very quickly.\nYou own Alphabet and Amazon. Are there\none of those that you have more\nconfidence in? One that you're more\nworried about?\n>> Yeah. So I I I like them both actually.\nAnd obviously they've obviously traded\nbetter over the last several months. I\nthink as it relates to Amazon and\nthinking about AWS, clearly to Liz's\npoint, we're expecting a reaceleration.\nI mean 21% is expected. I think they\nprobably need to show 22 to 23% uh for\nthe stock to continue to run. Ops\nmargins close to 12%. Um and they've\nobviously slimming down the workforce\nagain with that announcement of 16,000\nlayoffs, you know, about a week ago. But\nagain, the the the big story here is is\nthe capex as well, about $35 billion\nthis quarter. You know, the the market\nis asking for a return on capex. I mean,\nthat's obviously the story that's\nplaying out. I think Google a little bit\nof different story. I mean, fully\nintegrated, traded very well all of last\nyear. You know, Gemini 3.0 was a hit.\nSo, I just continue to watch that and\nand be hopeful as as we as we move\nforward through the year. Um, and Google\nCloud also growing at 35%\nyear-over-year. So, I I continue to like\nboth of these names. I want to bring one\nmore voice in this conversation.\nHalftime committee member Bill Baroo.\nHe's actually trimming his holdings when\nit comes to Alphabet and Amazon ahead of\nearnings. He joins us right now. Bill,\ntalk us through this trade. What's your\nthought ahead of earnings?\n>> Yeah, this started uh last week with a\nlittle bit and then more yesterday. Um,\nAlphabet and Amazon were both about a 7%\nholding in our main portfolios and about\na 14 and 15% holding in our concentrated\nportfolios. So, this trim, you know, we\nbrought it down to 5 and a half% each\nand about 9 to 10% each in the\nconcentrated. And really, it's it's less\non a conviction here and more about risk\nmanagement. Um, you know, we feel about\nthe the indices right now. They're\nthey're going through some rotations.\nwe're going to get these earnings and we\nwant to have the ability to be flexible\nthrough the earnings report. Uh but as\nwell what the indices turn out to do\nhere in the next couple of weeks. Um\nwith that said, I mean I I think there's\ndefinitely some some potential\nheadwinds. If you look at Alphabet, you\nknow, they're everybody on the desk has\nalready pointed to it. Capex, there's\nthey're moving more into the energy\nspace. What kind of capex is going to\ngoing to be a surprise? Uh cloud and AI\nsearch revenues, they've been a\ntailwind. Is it enough to offset it? Um\nand then and then Amazon I mean we saw\nthe reaceleration AWS last quarter. Are\nwe going to continue to see that and is\nthe bar already set to be very high? So\nagain these aren't conviction where\nwhere we're trimming them down because\nwe dislike the name but it's getting\ninto a more manageable space for us and\ngive us flexibility. Um you know whether\nwe want to buy these names more after\nafter the report or the weeks after or\nlook somewhere else. I mean there's\ndefinitely some other places too.\n>> All right. Um a bunch of analyst notes\nabout both these companies always uh in\nparticular William Blair saying 2026\nsets up favorably for Amazon. So you say\nyou're looking for a re-entry point.\nLet's say the earnings are very good.\nAre you worried that you're selling? I\nknow you're not trimming everything, but\nyou're selling here and you're going to\nhave to buy at a much higher level that\nthese these reports could actually be\ngood. Uh William Blair goes on to say\nthey think they're one of the best AI\nplays as the optionality stemming from\nthe technology extends beyond its\nservice to other companies driving\nefficiency and competitive position.\n>> You know, I don't disagree with them. I\nmean and that's why they're our two\nlargest holdings. I think out of five\nand a half% waiting in our main\nportfolios, uh it's still a very large\nholding and are concentrated, you know,\naround 10, it's still a very large\nholding. You know, again, I think this\nis more about the the risk management\nmove in general. Um you know, if I look\nout, I do see a lot of headwinds around\nApril and our plan coming into the year\nwas we thought the the equity markets\nwould have a very strong start to the\nyear. You're seeing it in some pockets,\nbut not all pockets. And um you know\nwith that plan was\n>> hey sorry about that. Uh yeah anyway I\nhope hope you enjoyed that segment there\non uh on this. I I don't think you know\none of the things that drives me nuts uh\nand you know I like the guests that CNBC\nhas uh or have that they get on here\noften but one of the problems that you\nhave is man it seems like the days the\nmarket goes down you get these people\ncoming out going oh yeah you know we're\ntrimming exposure and they kind of just\nlike reiterate everything right. Sorry,\nI had that phone call there. Uh, but\nthey reiterate this doom loop, unless\nyou get Tom Lee up, which is honestly\nit's so interesting and it's something\nfor you to know. I think if there's a\nlesson for you to learn or know just for\nthe rest of your life, uh, and they're\nrescheduling the BLS labor report for\nthe 11th. If there's one lesson to know\nkind of for the the rest of your\ninvestment career is these people will\nalways sell you the bullish story\nbecause that's how investor investment\nthese these adviserss make money.\nImagine you call a financial adviser and\nyou're like, \"Hey man, I want to move my\n$2 million portfolio or whatever to your\nfinancial advisory firm or whatever.\"\nAnd then the adviser's like, \"No, man.\nWe're going into recession. You'd be\nbetter off staying in cash, you you\nknow, and then you call the other guy\ngoing, \"Hey, man. I got two bill 2\nmillion bucks, you know, and they're\nlike, \"Oh, great. We'll put you into\nthis fund, this fund, this fund. We're\ngoing to get you the latest and greatest\nexposure, investment grade debt, this,\nthat, or whatever.\" They place you, the\nbanker gets their fees. So, so the guy\nwho maybe told you the right thing to be\ncautious to, to, you know, hold on,\ndon't invest right now, raise cash, that\nguy makes zero money off of you. The guy\nthat's like, \"Nah, man. Everything's\ngoing straight up.\" up. You know, the\nTom Lee strategy, that guy makes all the\nmoney. So, the whole industry is\ndesigned to tell you it can never be\nbad. And now, I hope it's not going to\nbe bad because I don't want to go into a\ndeep dark recession. But keep this in\nmind, if we go into a deep recession, if\nwe go into uh, you know, a the AI bubble\ncollapses, we get the layoff cycle. I\nput this together for course members\nthis morning, just sort of like a little\nsimple thing. So, I'll just show it to\nyou. Anyway, I go, \"Here's how this\nworks with CEOs, right? The stock market\nuh goes down. The CEO is not happy. The\nCEO is not happy because their\nstockbased compensation is at risk or\nthey might get fired.\" So, the CEO\ncomplains like the Service Now guy\nstarts complaining about the market\ngoing down. So, they're like, \"Well, we\ngot to get EPS up.\" Well, how are they\ngoing to get EPS up if if you know\nrevenue slowing down? Well, we're going\nto fire people. So, you fire people and\nthere you go. Uh and then you get your\nEPS up. But that's how you also induce\nthe very recession that you're trying to\navoid is as you fire people to to limit\nyour earnings per share exposure. And\nit's it's wild. So, you know, in my\nopinion, this is um this is really a\nhow should I put it?\nthere is going to be a a big bias from\nuh the you know Wall Street adviserss\nand talking heads always to the upside\nbecause they benefit from aum problem\nwith that is are we just breathing life\ninto a bubble that's meant to die you\nknow I don't know this right here makes\nme a little nervous there's another\nOracle logo over here I want to see what\nthis is uh Oracle yeah so you know This\nis interesting to me that they're now\nputting these investment grade credit\nratings on Oracle debt, which it's\nbecause the banks are trying to offload\nthat debt. You know, that's that's a red\nflag. Banks are like, we need to get rid\nof this. Now, I understand banks also\nbenefit from making a loan and then\nselling off the loan, right? This is\nunderstandable because then you could go\nmake another loan, but they also don't\nwant the they don't want to hold the\nbag. And so that's why when you look at\nthese private credit funds, they looks\nlike they actually turned red today. Uh\nwe're just here recently because some of\nthese were actually a little green\ntoday. But I mean that's why these\nprivate credit funds have been selling\noff. So private credit is like who's\ninvesting in Blue Owl right now? Like\nwho's throwing more money into Blue Owl\nto go finance meta data centers, right?\nI don't know. Sussy sussy baka, you\nknow?\nSo uh you could train a parrot to say\nbyebye and make the bird look like a\ngenius. Yeah. I mean, and in fairness,\nthe market does go up uh over the long\nterm, right? Like over the long term,\nyes, the market goes up. So, like, you\nknow, I look at and I go, \"Hey, look,\nwe've raised a lot of cash, you know, no\npersonal debt, no bank debt at the\ncompany or whatever. very very\nconservative, tiny little bit of stock\nexposure and and you know I've got a\nlist of my 10 favorite 11 favorite\nstocks that I really like but I'm also\nfully aware that you know the money that\nwe invest or you invest or whatever in\nthe market right now you know close to\nalltime highs it could get halded you\nknow so you kind of got to be careful uh\nand that's not to be super bearish let\nme show my bare bull scale and let's get\nto that Oracle article so if we go to my\nbare bull scale uh but it is why house\nhack is just sitting on cash right now\ntoo quite quite so you know we want to\nbe prepared but look at this you know uh\nI lowered uh after we got wash this was\na really big moment here wash was the\nworst case scenario after we got wash uh\nmy opinion uh is that we actually we\nlost a big chunk on the bareb scale here\nuh and this is now accelerated by weaker\nthan expected ADP numbers which both of\nthese numbers the ADP numbers or or\nwhatever. You know, weekly jobs have\nbeen at a 30k 32k basis. Some numbers\nwere coming in at a 48k estimate. You\nknow, everybody's expecting a beat, we\nget a miss. That's only slightly\nbearish. We're still in that midpoint\nrange, but boy, wash is just problematic\nbecause War should make you demand more\nrisk premium for being in the market.\nyou should be demanding higher returns\nfor investing right now because Kevin\nWalsh isn't going to print his way out\nof a out of a recession uh based on his\nhistory. Maybe he's a changed man. Maybe\nhe's going to give us a different uh\nresponse to what he's historically done.\nBut I generally believe that you should\ntrust people when they give you uh when\nthey tell you who they are. You know,\nwhen somebody tells you who they are,\nbelieve them. Uh\nand so\nhold on a sec. Give me a moment.\n>> The HIV portfolio, uh the quarter was\ngood. Shares up just about 7%. What do\nyou make of the outlook with and also\njust the fact that there's a new CEO\ntaking the helm of this company?\n>> Right. So the new CEO does make us a\ntiny bit nervous because the previous\nCEO, Emma Almsley, was the only one who\nactually delivered consistent earnings\num or consistent expected earnings and\nand met earnings in the last several\nyears. Um, but here's the bottom line,\nand this goes back to Liz's almost like\nopening comment, which is when she\nshifted her stance on where money should\nbe going in stock, she said, you said\nyou wanted to look for companies with\nlots of cash.\n>> And all of these companies like beyond\njust GSK in our portfolio, but Regeneron\nin our portfolio, Fizer, Bristol Myers,\num, they all are minting cash. So\nBristol Myers for example has 12 billion\nof free cash fl.\n>> So let's pop in over here. Uh so Oracle\nhere\nuh let's see here\nuh let's see let's see here it's funny\nhow perception change in September\nOracle raised its estimate of next\nyear's capex\nby 10 billion that was in September and\nthe stock rose by more than a third in a\nday. On Wednesday, Larry Ellison boosted\nthe forecast by 15 billion and the stock\nslumped 13%.\nUh it's like a little sun dial. Uh let's\nsee here. The sun moves around. In this\ncase, Ellison strategy remains\nessentially the same. Oracle was on\ncourse for 280 280 sorry on course for\n$280 billion of capex over the next 5\nyears according to BNB Parabus.\nClients including OpenAI, Nvidia,\nFacebook owner Meta Platforms have\ncollectively uh committed to 523 billion\nof revenue. But there's a growing lag\nbetween the cash out and cash in.\nUh Wednesday's bump to 2026 spending\nplan wasn't accompanied by a\ncorresponding increase in revenue.\n$80 billion plus fall in Oracle's market\ncap shows investors aren't thrilled\nabout this delayed gratification.\nThe big fear is that the tech companies\nracing to hone in and sell their AI\nservices may not need all that compute\nafter all. Blah blah blah. lobby. This\nis all old news. The size of the debt uh\nwhat is this second? The size of the\ndebt may not end up as cumbersome as\nfear. Analysts estimate Oracle will end\nup with 150 billion of net borrowings up\nfrom roughly 100 billion today. But its\nbusiness is growing too. If all that\ngoes to plan, Oracle's net debt would be\nabout 1.5 times IBIDA compared to uh\nthree times now. That's their net debt.\nNot all data center investment would be\non Oracle's dime. Some customers might\nbring their own chips, but they've been\nsaying this for a while. They didn't\njust suggest this on Wednesday. They've\nbeen saying for a while that, oh yeah,\nyou know, we're just going to switch to\na bring your own chips model. I think\nthat's cuz they're out of freaking\nmoney. Uh I don't think that's a bullish\nthing. I I I I see that as like, wow,\nyeah, you guys can't even make the chip\ninvestments, which I don't really want\nto hold the chips either. Um I I get a\nlittle bearish about uh like there are\nplenty of software companies that I\nthink are a steal that have massive\npricing power. Uh like into it right now\nis a one peg. It's insane. Like I've\nbeen waiting for this company to get\ncheap. Uh and look at this. Like I'm\njust waiting for a potential RSI\nreversal here cuz look at this. We are\nso oversold on into it. You're at you're\nat 18 right now. Uh, but you've been at\n18 over here as well. So, I'm waiting\nfor a little bit of an RSI reversal and\nthen I want to buy uh the dip over here\non into it. This is a one peg and this\ncompany has regularly been like a four\npeg. So, it's, you know, it's it's\nreally compressed its valuation which is\nfan freakingastic for a company with\nmassive pricing power. Uh, and so it\nthis does create opportunities, right?\nSo like while it's understandable to be\nconcerned like there are opportunities\nyou know I always I always joke and I\nmean it's less of a joke it's it's also\nkind of true uh you know our company is\nraising money assuming our artificial\nintelligence is worth zero this isn't a\nsolicitation for you to invest remember\nalways read the offering circular uh you\nget 5% plus all upside you can invest\nwith credit card a wires no fees uh\nwe've raised $15.1 million in the 90\ndays ending Jan 20th which is awesome\nobviously read the details but My point\nof this, but the point of me bringing up\nthis reinvest AI thing is what I think\nis so remarkable is uh you know this\nthis to me like our company has zero\nvaluation on AI. So it's like you know\nthe real estate company has its\nvaluation. That's where people are\ninvesting in the AI is already you know\nhas zero valuation because we're raising\non a valuation we did before we had AI\nour own models. These are our own\nmodels. This is not like some some\nrapper. These are our own models that we\ntrain. Uh, and it's really cool because\nI think that like it doesn't matter how\nbad things get in software. Those that\ncreates opportunity because it gives\nupside to the surviving companies that\naren't heavily indebted. The worst case\nscenario right now is that you have a\ncompany with a lot of debt that gets\nsmoked. Uh, like I was actually looking\nat Super Micro this morning. They don't\nhave that much debt. You know, if you go\nlook at uh the debt over at Super Micro,\nuh their payables did explode, but\nthey've got essentially the cash and\naccounts receivables to cover their\ndebt. Uh and then of course they've got\nsome convertible debt here. The bigger\nproblem with a company like Super Micro\nis their gross profit margin almost\nhaved. Like how does your gross profit\ngo from 11.8% to just 6.3?\nThat's insane. So you have this massive\ncompression over here. We did a big\nanalysis on NPhphase as well this\nmorning uh in the alpha membership which\nremember you can always join that at\nmeet kevin.com and then you get all of\nour fundamental analysis and you could\nyou know go in the stock tab of the app\nand look at historical analysis. Uh but\nuh wow Oracle now down another 6%.\nWhat's really remarkable there here is\nthis company is now look at this. Uh\nyou're at 144 divided by 344.\nYou're now down almost 60% on Oracle\nstock. Let's grab Oracle really quick.\nOracle investor relations. Let's just go\nlook at their debt exposure because this\nis uh this is quite the sellown uh on\nthe stock and uh you know raising money\nmore money I in this environment. I\ndon't think there's much of a capacity\nfor it, but let's go grab the December\n11th. So, this is going to be the um\n1211 2025. This is the Oracle 10Q\nearnings statement. Uh we won't, you\nknow, it's pretty boring to look at\nfinancial statements, so we won't be in\nthere for very long. I always try to\nkeep it pretty simple when I'm on a live\nstream. Uh let's take a look here. So,\nI've got cash of $19.2 billion, right?\nSo, that's my cash right now. What bills\ndo I have to pay? Uh we're going to add\nback in deferreds right here. Right? So\nyou always add back in those deferreds.\nUh unless the company goes bankrupt, you\nknow, that's when those become uh\nrefundable basically, right? And that\nbecomes a problem. So uh I have $27\nbillion of debt and I have 19 uh.2\nuh of cash, which really suggests I'm\nupside down by about 10 bill, right? But\nthat that's not so much the concern\nbecause they're raising money now.\nThey're issuing $20 billion of shares.\nThey're raising money. So, what do we\nhave over here? Current payable. Look,\nthese are the long-term debts. Okay?\nI've got a hundred billion of debt over\nhere. I've got 11 billion over here.\nLease liabilities. I'm less worried\nabout those. And I've got another $9\nbillion of debt over here. So, I've got\nabout $120 billion of non lease debt.\nThis is a lot of debt. I mean, you want\nto see a debt statement. Watch this. If\nI go down to the debt statement where\nthey show you like their outstanding\ndebt, it's pages long. Like I don't I\ndon't know that I've seen one that long\nbefore. I had to find the damn thing. Uh\noh, it might be in the 10K. I don't know\nif it's in this, but wherever it is\nwhere where they list their outstanding\ndebts. H it's probably in the annual\nreport where they they list their\noutstanding debts. It's like a chapter\nbook. Uh and I mean it doesn't matter\nlike it's it's all related to those net\ntotal numbers that I just showed you. I\njust think it's interesting when you\nlook at it because when you look at it,\nit's like, \"Oh, wow.\" Yeah, that is\ncrazy. Uh, and I think it's something\ncool to see. But you could see all of\ntheir maturities\nuh for all their debt. You could do this\nwith Micro Strategy as well. And and\nthere there it is. There it is. Look at\nthis chapter book. Look at this. Notes\npayable, bro. Imagine like going to your\nCPA and being like your CPA is like,\n\"Yo, uh, go ahead and list your debts,\nplease.\" And then you have to list all\nof these debts out. Look at this. This\nis crazy. I mean, like, some of them are\nlong-term, right? Which is nice, and\nyou're going out to 2050 on some of\nthese because you're doing these 20 30\nyear notes, but I mean, this is insane.\nUh, and they're just adding to it,\nright? It's kind of wild. Uh, so, you\nknow, that's the broader concern that\npeople have. And and now when the banks\nare starting to say, oh, you know, we\nwant to offload to private credit and\nprivate credit's like, we don't have any\nmoney to take. Oh, crap. What a\nsurprise. You know, the market now on\nOracle is down 6%. We've got Palanteer\ndropping even more, down 14% now. AMD\n$200. Holy smokes. Pretty sure that's\nwhat I had in my alpha report this\nmorning.\nUh,\nlet's see here. Where is it? Where is\nit? Where is it? I just I like looking\njust so I could see uh what what I said\ncompared to what happened because it it\njust helps everybody learn, too. Uh so\nuh\nokay where was it? Oh yeah yeah yeah\nhere it is.\nOkay so I wrote this morning\nuh oh this was yesterday. Yesterday\nPalanteer selling off would be a warning\nTesla back to 414. That's exactly what\nhappened. Uh ADP well worse than\nexpected. Worst claims blah blah blah.\nWhere is the part? What do we need\ntoday? Oh here we go. Uh, if AMD falls\neven more and loses $200, something is\nquite wrong. Institutions have flipped.\nWatch for an AMD selloff at the open\nbecause that brings down the cues.\nWild. Uh, okay. And then where's where's\ncrypto right now? Look at this.\nThis is crazy. We're now sitting at this\nis the one minute chart. It looks like\nthis has really accelerated within the\nlast it's been about the last 3 hours.\nSo since market open since market open\nwell market open was 9:30 right here.\nThis was market open. We went from 746\nto now 72. We're about to lose 72. We're\ngoing to be in the 60 soon.\nLet's see what CoinGlass has on\nliquidations. Coinlass liquidations. But\nyeah. Anyway, if you want to join the um\nMeet Kevin membership, remember that's\nat meetke.com. And the real estate AAI\nis at househack.com or reinvest.com.\nPeople keep asking me like why what's\nReinvest? It's it's what we're going to\nbrand house hack to over the long term.\nIt's the same company. Okay, so 24hour\nwreckage here. I've got $359 billion in\nBitcoin, 324 in Ethereum. How is\nEthereum doing? Is Ethereum still above\n2K? because poor Tom Lee is just getting\nkilled right now. Uh we've got\nWow, just under 2100 right now. Wow.\nWhat a shocker, huh?\nHoly smokes.\n2100. What's Tom Lee's cost basis these\ndays? I think he's he's got to be down\nlike 50%.\nOh man. Um Tom Lee. Let's see here.\nYou know, he blocked me cuz I'm too\nblunt about him, but uh that's okay.\nSo, this is what people are saying on X\nright now that this is his P&L right\nnow. So, total invested $16 billion\nand uh down currently about 7.1 probably\nmore today because this was yesterday.\nSo, it's probably even worse right now.\nHoly smokes. I mean, I I don't really\ncare about Tom Lee. I feel more bad for\nthe people that, you know, blindly\nfollow Tom Lee into these investments.\nYou know, like I I I like to try to be\nreally rational with investments. You\nknow, it's like it's like I'll give you\nan example. Like I actually think\nNetflix is a fantastic company, but uh\nI've been saying that this downtrend is\nshowing no signs of stopping. We just\nbroke into the oversold territory, but\nwe could actually extend way lower than\nthat. I mean, if you look at 2022, RSI\ngot down to 17, right? Uh and if you\nlook back, that's probably some of the\nworst. You go back in history, those are\nsome of the lowest relative strengths on\nthe weekly basis. I like using the\nweekly basis.\nA and um you know I think that uh\nNetflix is a really good long-term buy,\nbut the problem is if you buy it now,\nand I've been saying this, if you buy it\nnow, it's probably going to go down\nmore, you know, but Tom Lee is not going\nto tell you that. Uh and that's I think\nthe part that's missing is you don't\nhave advisors who are willing to tell\nyou, listen, we could go into a 10-year\nrecession. Donald Trump is going to look\nlike a clown. You could lose your job.\nDon't get wiped out in this down cycle,\nright? Invest what you're willing not to\nlook at for 10 years. You know, then you\nget Tom Lee. Ethereum's going to 7,000\nin January. Come on, man. That's like\nyou should be sued for that.\nIt's It's crazy. I Whatever. Whatever.\nSo, uh anyway, Q's are now down. Uh\nwe're about to lose 600. 595, I think,\nis our next stop. Yeah, 595 is our next\nstop. Uh we'll probably get a recovery\nhere at some point. Usually, you know,\nwhen we get sell-offs like midday, we\nusually end up recovering like you get\nto like this peak selloff, peak margin\ncalls, and then you get some kind of\nrecovery. So, you know, it would seem\nodd for this to continue to nose dive\nlike this. That would be an AMD losing\n200 would be really bad. And it's losing\n200 right now. I hope it doesn't close\nunder 200 because that's a sign that\ninstitutions are giving up. Uh which\nwhich is not good. Uh, not good. So, um,\n200 AMD is is really the only thing\nthat's held Nvidia up. In my opinion,\nNvidia has been rangebound uh because uh\nor you know AMD had its pop but then got\nstuck. That's been sort of my thesis. I\nkind of look at these things in pairs.\nSometimes I can't articulate that logic\nas well as maybe I should, but that's my\nheadsp space that that AMD dropping 200\nis is is bearish for this range for\nNvidia as well. But again, I I hope that\nwe could just bottom out here and\nrecover and uh and recover into the\nclose of the day. Like if I was a day\ntrader, I I would be potentially\nuh looking for, you know, 5 minutes of\nuptrend. I get five minutes of uptrend,\nsome call options towards the end of the\nday. Hope we get some kind of recovery.\nUh holding 607 would be great. I don't\nknow if we're going to get it. I mean,\nthis is this is a an intense wash out\nright now that's happening. Uh, if I go\njump into let's see what the doomers\nhave for us. Uh, let's see here.\nBasset, we always support a strong\ndollar. Yeah, whatever. Oh, how's the\nbond market? You know, because the bond\nmarket also snuffs some of this out. The\nbond market generally gives you its\nheads up via the yield curve.\nAh yeah yeah yeah. So remember 125 is\nyou're in a recession right? So, we have\nbeen trending towards this and and a lot\nof people, you know, I get it. They\nthey've they've been frustrated uh by my\ncomments that you should be cautious.\nThat caution in fairness started a\nlittle early. You know, I got cautious\naround\nSeptember, a h probably August, July,\nright around here, right around the\nyield curve going across zero.\nSo, that was a little early, a little\ncautious over here. And so I admit this\nwas early. Uh but you know it's not\nuncommon for me to come early\nwith these these thoughts. Uh and then\nthe labor market's obviously been a big\nconcern, but we've seen this sort of\njust gradual rising here on the 102\nyield curve. It's really not until 125\nthat you're in a recession, but by then\nit's too late. You know, you can't sell\nat 125. Uh and I'm not going to sell any\nof the stocks that I have exposure to.\nLike I've already done that. I I sold\nNvidia between probably average was like\n195 is when I sold Nvidia. I told\neverybody in the alpha report I would I\nwould send out alerts when I sell Nvidia\nand I sold some at like 205. I sold some\nat 195, some at 185, you know, whatever.\nIt was kind of spread out in that range\ncuz I was selling a little bit at a\ntime. Uh but but that's when I started\nalso becoming that was just that was in\nlike October. I started becoming bearish\non hardware because I do think that\ncycle is unfortunately topping out\nbecause the debt is starting to get\nconstrained and we're seeing that now if\nyou jump over to these Bloomberg pieces\nor sorry uh the um uh this you know the\nbanks trying to get new people for loans\nover here on on hardware not great you\nknow this this is red flag so that's why\nI was sending sending these alerts like\nhey I'm selling Nvidia you know I think\nI think you know the big stretch is over\nfor it and we're getting to late cycle\nand hardware. Uh, and getting tapped out\non financing is just adding insult to\ninjury right now. Uh, again, why you\nknow, and and I I say it not to pitch,\nbut I like and I realize I I probably\nwent debtree, me personally, debtree\naround October of this year, you know,\nright around here. And then uh the\ncompany itself hasn't taken on any bank\ndebt. But the reason we haven't is\nbecause I've been so uncertain about,\noh, this is definitely going to be a\nsoft landing and I'm still sitting at\nlike a 5.3 on the uh bear bull scale. Uh\nagain, that's that's not arguing, oh,\nwe're definitely going into the toilet.\nYou know, I do think some of this\nsoftware selloff is overdone. Uh and I\nmentioned that this morning as well.\nLike I do think there are going to be\nsome glorious opportunities to buy\nsoftware cheap but unfortunately you\nknow sometimes markets as we like to say\nthey could stay irrational for longer\nthan you can remain solvent. So you have\nto be careful yoloing into debt for some\nof these. Again I maintain that this is\nridiculous opportunity on on in it. But\nyou know things could get worse. I mean\nif I go to the week chart on this we're\nin oversold oversold on into it has not\nhappened since the summer of 2022 on the\nweek chart. So these these sell downs\nare quite remarkable. Let's go to\nSalesforce. Salesforce Salesforce has\nbeen at these levels before. What about\nSnowflake? Snowflake has been at these\nlevels before. How about Palanteer? See,\nPalanteer is not even oversold yet on\nthe week chart. Palanteer is down 13%\nright now. And we're sitting on a\nrelative strength index at 39. You know,\n30 is is your threshold for oversold. Uh\nwe're actually building another this is\nsort of a side project that we have.\nWe're building uh an an AI sort of\nversion of the alpha report not to\nintegrate with the alpha report to be a\nseparate thing but basically uh you know\na tool that you could utilize to find\nthese reversals uh more easily and to\nsort of notif like give you push\nnotifications when the reversals happen\non the weekly RSIs. The weekly RSIs are\nlike I feel like my bread and butter for\nthose reversals. But uh but yeah. Uh\nokay, cool. Let's let's keep going to\nlook at um uh what we have\nfrom Oracle again. This was uh let's see\nOracle. We saw that. Okay. What do we\nhave over here? Russian spycraft. Then\nyou got Russian drop. European European\nsecurity officials believe two Russian\nspace vehicles have intercepted the\ncommunications of at least a dozen\nsatellites over the the continent. Uh\nokay. Okay. So, it's intercepting the\ncomms, not exactly the actual um\nwhat's it called? Um you know,\nsatellites. So, it's not like they're\nthey're attacking the actual satellites.\nThey're just trying to potentially put\nthemselves in the way and the capture\nthe data. I But I'm surprised though\nbecause this data should be encrypted.\nSo, if they're sending non- encrypted\ndata, well then anybody can intercept\nit, right?\nSo, uh I wonder if these low do do uh do\nlow earth\nsatellites uh encrypt data?\nUh low earth satellites frequently\nencrypt data. However, encryption is not\nuniversal. Are you kidding me? Oh my\ngosh. Look at this.\n50% of satellite data, including some\ngovernment and military traffic, has\nbeen found unencrypted, leaving them\nvulnerable to interception. Come on,\ndude. That's like that's like the\ndumbest thing I've ever heard, dude.\nThat's so dumb. Why would you not\nencrypt government and military\nsatellite data and then anybody with a\nradio can listen to it? That seems dumb.\nI mean, I have I have multiple radios on\nmy desk. Like, here's a Well, you can't\nreally see it. I don't think you can see\nit. I have this uh I have an encrypted\nradio right here. Can you see it?\nUh, it's never going to focus on that,\nis it? Oh, yeah. There you go. I've got\nan encrypted radio right here hardwired\non my desk. And, you know, good luck\nlistening to that. Uh, so ain't going to\nhappen. Um, like you know, if I can\nencrypt, the government certainly should\nbe able to. Oh, I think it's hilarious.\nUh, okay. So, let's try the journal.\nOkay, so\nthe journal. So, that was Russia. This\nis stupid.\nUh, what is this? Oh, yeah. Here we go.\nLet's go look at this. We've got\nsomebody writes Nari. Nike is up. Is\nthat true? Let me see here. Tesla under\n400. What we got here? So, Nike. Yeah,\nNike has been on its its frustrating\ndowntrend here. Invest in communications\nand security companies. Yeah, no\nkidding. What do you like, Cloudflare or\nwhat? How's Cloudflare doing? Let's try\nnet gov is lazy. There's a video of a\nYouTube guy intercepting data. Wow. Send\nthat over.\nUh, that camera quality is that this\ncamera I actually do like it a lot. This\nis a uh I think this is a one one two\nfocal. I I don't use this angle a lot\nhonestly. Uh this is\n1.2.\nSo that's how you get the you know the\ncrazy bokeh in the background. And you\nknow we're what are we streaming at\nright now? I think we're I mean I'm\npretty sure I'm bottlenecked at 4K but\nthat's okay. Uh sorry 4K. I'm\nbottlenecked at 1080. But anyway, uh,\nso,\nokay, we're getting a little bit of a\nrecovery here on the cues. No, that's\none candlestick. Let me go to unaveraged\nfor a moment. Two candlesticks. Two\ncandlesticks on averaged. All right,\nwe'll watch it. But, uh, let's keep\ngoing here. Or we'll come back to it,\nrather. What's this? Reading the runes\non WS. Kevin W going to be an inflation\nhawk or Donald Trump's poodle. Poodles.\nRussia is watching you. Yeah. Yeah,\nmaybe. Uh, yeah. I don't care where\nyou're from. You know, it's um just\ngonna add value to the world.\nOkay. Oh, cool. We just got another\nafter uh Matterport done. That's cool. I\nalways find that very exciting. Uh these\nuh what's it called? Um\n3D scans. So cool.\nUh, okay. So,\nlet's see here. He's more of a\nbouquet\nfuzzy in Japanese. Oh, that's\ninteresting. I didn't know that. Is a\nJapanese lens after all. Okay. So, but\nhis recent statements on inflation\noutlook uh suggest the latter, right?\nExactly. His recent commentary suggests\nhe's going to try to come in there and\njust dump rates.\nLet's see here. Walsh's words indicate\nhe's very much the hard money central\nbanker.\nSpeech given in 2010 when the economy\nwas still struggling with the\nrecessionary aftermath. He already\nstarted worrying about the Fed\ncredibility.\nUh-huh. He made four main points. First,\nthe Fed independence applies only to\nmonetary polic or applies only to\nmonetary policy, not regulatory policy.\nSecond, the Fed as a first responder\nmust resist the temptation to be the\nultimate rescuer. Yeah, that's that's\ngood and bad, right?\nUh,\nso\nit's it's good because it means maybe\nthe Federal Reserve won't print money\nlike always and uh and and frankly\num you know distort the reality of how\nan economic cycle should go. However,\nit's bad because if you have somebody\nlike this who ends up burning the\num what's it called? Uh the entire\neconomy into depression. Then you ask\nyourself, well, what's the lesser of two\nevils, right? Somebody's asking about\nbond yields. Uh well, let's look at the\ntwo-year really quickly if we're seeing\nany flight to safety. So, two-year is\nreally going to be a proxy for rate\ncuts.\nSo, the 2-year right now is down 1.7\nbasis points, and the 10-year is flat.\nWow, that's interesting. More people\nfleeing into the 2-year. Uh people often\nflee into the 2-year uh as a safety\ntool. So, you look at the 10-year as\nconcerns over long-term inflation and\nbudget deficits, and the 2-year as\nconcerns over near-term policy. So ADP\ncomes in weak, the 2-year goes down\nbecause they think the Fed might be more\nlikely to cut rates on weak jobs data.\n10-year stays high because they're\nworried about inflation. That's just\nsort of like the bond market analysis.\nBut as those two things diverge, right,\nas the 2-year gets bought under fears\nthat rate cuts are coming and the 10ear\nstays high because of inflation, there's\nthis belief in the bond market that the\nfurther that spreads, the more likely\nyou're in a recession or going into a\nrecession because obviously in a\nrecession rates are going to come down,\nbut that's going to lead to more debt.\nSo that's how you get that divergence.\nNow once you're actually in a recession,\nusually what happens is you get that\ndivergence. That's how you get the 102\nyield spread. But both of the yields go\ndown. And that's why, you know, some\npeople make recessionary bets. I've made\nthem in the past, too. It's just hard to\ntime. Uh, you make a recessionary bet on\nlike TLT, for example, because TLT, you\nknow, when and if the economy goes into\nrecession, the 10-year also gets bought\nas a flight to safety and both of them\nget bought. The two just gets bought a\nlittle more. Uh, problem is, you know,\nwith Donald Trump's inflationary\npolicies, TLT has been a horribly\nperforming asset. uh uh or I mean it's\nmostly sideways. So it depends on how\nyou were exposed to it. But the reason\nit's been so stuck is because this is\nthe market telling you we're not\nconvinced that inflation is going to be\nsolved. Uh and so it's just it just\ncan't get out of the shelf, if you will.\nYou know, you look at what happened\nduring COVID TLT exploded because of\nrecessionary money printing and this\nthis actual flight to safety. That's\nkind of interesting. Uh Q's now actively\nrecovering, which is good. So we've got\nmore recovery here. This is on the\naverage. I now have six green\ncandlesticks. This is positive for uh\npotentially getting a rebound back to\n607 by the end of the day. It's not\nunusual. You get those liquidations, you\nget the panic during the morning and\nthen things kind of recover a little bit\ntowards the end of the day. The broader\ntrend unfortunately right now is still\nsomewhat down which isn't great. But\nanyway, I've got Bitcoin\nuh let's see here. Bitcoin at uh 721 is\nwhere we just had a little one minute\nchart double bottom. Cloudflare is also\ndown on a day like today. Actually, look\nat the discount you're getting on\nCloudflare right now. Let's go look at\nthe uh valuation of Cloudflare because\nthis is a great company that I don't\nthink is going anywhere. I love\nCloudflare and shout out to anybody\nassociated with Cloudflare, but uh their\nvaluation has been very high and it's\nbeen hard to justify buying them. I\ncan't get my iPad to turn on. It's fine.\nI'll I'll Oh, did I do it? This iPad's\nso bugged out. Oh, there we go. Okay,\ngood. It's like turning Siri on and\neverything. All right. Okay. Okay. So,\nif I go to net,\nuh, yeah, it was a five peg, right? So,\nhere's some of my notes on it. Uh, I\nwrote the following on Cloudflare. Wall\nStreet estimates a 32% average growth\nrate over the next four years. That's a\nfive peg. They're heading towards the\nconversion of their 2026 notes, so\nyou're going to get some dilution\ncoming. They have plenty of cash either\nway in case they have to pay off that\ndebt. Uh I'm not bearish, but the market\nis going to punish uh uh you know, see,\nlook at this.\nUh if there's a market hiccup in early\n2026, they have to pay cash for the\nconvertibles. The market might punish\nthat. They'll still have cash available,\nbut I'll watch for a discount. Momentum\nis too hot. This was at the end of the\nyear. Valuation sucks. pricing power is\ngood and the balance sheet is great. And\nso now if you look over here, you\nactually see the stock is trading down\nuh quite a chunk here. Now you're at\ncurrently trading for 163 divided by\n260. You're trading down about 38% from\nhighs.\nUh what I showed you just now, by the\nway, that's the uh stock tab that all\nthe uh alpha course members have access\nto. So you could kind of just like pick\non the side. Hey, I want to see Kevin's\nanalysis and then you pick kind of a\nstock on the side. You know, none of\nthis is like AI driven. This is just me\nkind of analyzing stocks. And so we got\nthe tickers and stuff and you can kind\nof pick and see the historical stuff\nthat I've said about a stock or\nwhatever. Uh oh, that's those are a lot\nof windows. Let me close some of these\nwindows. A mess, huh? Uh so um let's see\nhere. Then we've got\nuh let's close this. Close this. I don't\nneed Photoshop open. They're going down\nanyway.\nOkay.\nSo, now let's see what the doomers have.\nSo, Doom Bugger. We'll actually look in\na couple different places for the\ndoomers. Let me see what they're saying\nin the background. So in the background\nit says the dollar's bounce looks\ndurable as capitulation fades. Stock\nselloff worsens on report of plans for\nIran talks collapsing\nuh per Axios.\nOh, and then is this just a rotation or\nsomething more profound?\nYeah. Well, that's why AMD going under\n200 is a problem. Software meltdown is a\nbig drag for the leverage loan market.\nPrivate credit. Yeah. Uh, CLLOs's,\nprivate credit, Arcane Investments, all\nthat. Somebody says 617 on the cues\ntomorrow. I have a couple calls. Uh, I\nmean, yeah, that's it's\nhard to say, you know. I don't I don't\nlike making midday predictions. I always\nlike to make my predictions right before\nmarket open. I found that\nmy This is just my personal\nfinding of of my own trading. I find\nthat my trading is much more on point at\nthe beginning of the day right here in\nthis moment uh rather than during the\nmiddle of the day. Mostly because like I\nthink the psychology is that a lot of\npeople are looking for trades at the\nbeginning of the day and fewer people\nare looking for trades during the middle\nof the day. So there's there's you know\nless momentum that compounds during the\nmiddle of the day. So it's hard to\ninitiate trades in the middle of the\nday.\nOkay. Uh what was I going to look at?\nOh, Axios. Yeah, Axios.\nAxios,\nplans for Iran nuclear talks are\ncollapsing. Well, that's not great.\nOkay, hold on a second. We've got um\nwe've got some crypto scammer that\nsubscribed to the channel and uh\napparently is now spamming crypto trash.\nSo, that you know what that means? We\nare going to have to go to turning off\npoverty chat.\nUh, blame the crypto scammer. Poverty\nchat's going away. It was nice. It was\nnice chatting with y'all.\nAll right. It's all right.\nYou can blame the fraudsters. Yeah, it's\ngot to be a sad life when you have to\nsteal from people to make a living.\nAll right. So, plans for Iran nuclear\ntalks are collapsing. The US told Iran\non Wednesday that it will not agree uh\nto Thran's demands to change the\nlocation and format of planned talks.\nWhy does it matter where the talks are?\nThe standoff could block the diplomatic\npath and convince Trump to opt for\nmilitary action.\nUS and Iran had agreed to meet in\nIstanbul,\nbut Iranians said on Tuesday that they\nwanted to move the talks to Oman and\nhold them in a bilateral format. US\nofficials considered the request to\nchange but decided to reject it.\nOkay.\nWe told them it is this or nothing and\nthey said okay then nothing. Uhoh.\nSee people dig in their heels in\nnegotiations and it just gets dirty\nreally fast, you know. Oh, here's\nsomebody actually talking about\nopportunities in software. Let me listen\nfor the model. But when you look at\nspecifically with Snowflake and\nthey're not seat based prices, they're\nconsumption based prices. So as people\nare using more data and touching more\ndata, their revenue is going to grow. Uh\nand we think both those companies have\nbig advantages in this new world. So\n>> what about IoT?\n>> So IoT is a slightly different story.\nThey are in the market of doing\n>> fleet management, telematics, uh those\nsort of things. But what their real\nadvantage is is they're embedded in\nthese businesses that need their\ntechnical help. When you think of where\nAgentic Technology is happening and\nwhere it's going, it's not going to be\nimpacting the people that are running a\nfleet of petroleum trucks or that are\ndoing asset management for tagging of\ngenerators in the field. IoT Samsara has\ndone a huge amount of work about\nbuilding AI functionality into their\ncore product so that they can go to\nthese businesses and help with\npredictive maintenance or safety\ntraining and things like that. And that\nactually for them is going to allow them\nto upsell and cross-ell into this\ninstalled base at a much faster rate\nthan we would have thought of before.\n>> I want to ask you, I don't know if you\ncan answer it, but maybe you can answer\nand broadly or you can be specific,\nwhatever you want. What about the likes\nof Salesforce? Just to pick the elephant\nin the room, you know, down on a 5-year\nbasis and centering DAO and yet if you\nlook into next year, it looks like it's\nstill going to have 9% revenue growth\nsimilar to last year, 33 34% operating\nmargin perhaps. And this stock has been\ncut in half over the past 15 months and\nthe multiple down 20 points.\n>> Yeah, exactly. So, the application space\nin general is at the focus of this storm\nas people begin to wonder about, you\nknow, what's the value of a systems of\nrecord uh company and how much can this\nbe replaced?\n>> We think it's really important first of\nall for investors to\n>> be positioned correctly across that\nentire space and not be making a massive\nbet one way or another across\napplications because it is so uncertain\nright now. Do you think in other words\nthere's a legitimate case to be made\nthat a company like Salesforce, you\nknow,\n>> so I don't want to talk about Salesforce\nspecifically in this instance, but what\nI would just say is is that the bare\nnarrative is is that the long-term\nannuity value of an applications company\nmight be not as big as we thought it\nwas.\n>> So basically the risk premia goes up and\nhe he has a point he has this point of\nsaying like be careful being too\nbullish, right?\nuh and and having too much. I think\nthat's fair, you know, like I think\nthere's a there's a buy the dip\nopportunity. You know what? F it. Let's\nbuy the dip right now. I'm going to buy\nthe dip right now.\nUh let's go.\nAnd\nwe're going to go for What am I going to\ndo? What am I going to do? What am I\ngoing to do? Go buy the dip over here.\nUh okay.\nBye.\nJust a little bit. I buy like 20 grand.\nHow's that sound? H 22,000 bucks. Fine.\nWorks for me.\nBye.\nAll right. Perfect. I'll send uh what I\nbought\nin our uh little alerts thingy. Uh just\nwent through. All right. Let me send\nthat and then let's listen in again for\na moment here. you've got exposure to\nsome of the semi in the chip space.\nYou've got KLA, you've got AMAT. Um are\nyou sticking with those two? Is there\nanything going on here you\n>> So, you know, we feel really comfortable\nabout this infrastructure buildup, even\nmore comfortable than we are about the\napplication space, frankly.\n>> You know, every time we talk with the\nCFOs and the CEOs of the big frontier\nmodel companies, their commitment to\nspending on this buildout only goes up.\nSo, the backdrop there is it's almost\nthe inverse of software where there\nisn't a question about, you know, is\nthis getting replaced? It's a question\nof how much and how fast is the build\ngoing to happen. What we're looking for\nthere then is where are their key\ncapacity constraints. One of them right\nnow is in the actual buildout of of\nmanufacturing capacity for semis. That\nbenefits semicap greatly. You know\nyou're seeing incredible tightness\nacross memory uh and in terms of you\nknow the logic chips that are happening.\nWe think that you're going to as you\nmove through 26 and into 27 you're going\nto see an acceleration of equipment\nbuildouts uh into the clean rooms are\ngetting built. So that sets up a really\nnice backdrop equipment. Yeah.\n>> And then when you think about the core\nmicroprocessor companies, again, we\nthink\n>> Musk wants dirty rooms.\n>> When you look at AMD's rumor is there\nwas a little bit of noise around their\nChina revenue and there was some\nconcerns about this year's growth of the\ndata center business. We don't think\neither one of those is a durable\nquestion from our mind. So if you have a\nlong horizon and you understand kind of\nwhat you think the opportunity is, we\nthink there's a great opportunity in a\ncompany like AMD.\n>> All right, Brooke, it's been great to\nhave you. Really appreciate your time\ntoday. Brooke, I should mention you also\nlike Door Dash, you know, Meta Texas\nInstruments. So you're kind of up and\ndown in terms of size, but um I guess my\nquick final question as the broad one\nfor the market is in a year when so far\nthe dividend stocks are leading the way,\nthere's this defensive tilt even with\nthe ISM outperforming, maybe that's part\nof this broadening trend.\n>> How does it feel being in the highly\nconcentrated tech space? Do you think\nthis is just a necessary shakeout?\n>> So you know, first of all, within tech,\nthere's so much opportunity to make\nmoney in lots of different stocks that\nlike we like, you know, Texas\nInstruments is not an AI play. Texas\nInstruments is being driven by the\nrecovery in uh broad-based industrial\nspending. Uh they're doing a really\ninteresting acquisition today. Like\nthere's lots of reasons where you can\nfind great opportunities around AI, but\ninvestors need to remember like AI is\nthe thing. This is the biggest trend\nwe're going to see for the next decade.\nIt's going to impact massive parts of\nthe economy and you need to be front\nfooted about how you address that and\nwhere you see the opportunities.\n>> Kind of fun unless you're in a name\ndown, you know, 20% in the week. Uh,\nBrooke, really appreciate time. Brooke\nwith Goldman Sachs. Speaking of which,\nanother name that's been hit hard by\nthese new AI tools is Legal Zoom. The\nshares are off 17% since Monday after\nAnthropic announced its entry into the\nlegal tech space yesterday. But the CEO\ntells us the new technology is actually\na massive accelerant for his company and\nfor Main Street. And he says this will\neffectively expand the market. Joining\nus now is Legal Zoom CEO Jeff Styel.\nJeff, it's great to have you here.\nWelcome.\n>> Thank you, Kelly. Appreciate it. What\nwas going through your mind yesterday?\n>> I I mean the you know the the usual\nthoughts when when your stock drops for\nyou know for no good reason especially\nwhen our company frankly is a\nbeneficiary and excited about\n>> dude legal zoom. Oh, come on, dude. Of\ncourse, you're going to drop from AI\n>> involved and engage particularly in our\nspace because it means we can do more to\nautomate the technology that we know\nwill be automated and displaced and then\nfocus on the human in a loop aspect that\nwe've been building out over the last\ncouple of years that we think will be\nthe driver for us in the long run.\n>> Tell me about Harvey. As I understand\nit, there are actually enough of legal,\n>> you call them AI tools in the space that\nare experiencing some adoption. So,\nwhat's the differentiation between these\nnew models that are going to get so much\nbuzz and the market position that you\nthink you're in?\n>> Sure. And and it really is a very\ndifferent position between what Harvey\ndoes and frankly what anthropic\n>> All right. I don't really care about\nthis legal term today. Uh, somebody\nhere, uh, Taylor Taylor donates $5 to\nsay, \"I'm having a hard time reconcile\nhow investors reconciling how investors\ncan say SAS is dead because of AI, but\nthe AI trade is a bubble. Seems like the\ntruth is in the middle.\" It's actually\nreally interesting that you say that.\nUh, I'll show you something that I wrote\nin our alpha commentary this morning.\nUh, and I'll just show a part. I I'm not\ntrying to give away everything that I\ntalk about on the the live streams in\nthe morning, but look what I wrote this\nmorning. literally in the alpha market\ncommentary. Both cannot be true. AI\nkills all software. AI hardware is a\nbubble. Both cannot be true.\nSo yeah, you know, that's uh that's\nthat's interesting to me. Uh\nso anyway, all right, good. So let's see\nhere. Then we have let's go to Oh, look\nat that crypto rebound right here.\nLook at that.\nAllan says, \"I bought the dip yesterday.\nSame price you just bought.\" Oh, let's\ngo. Uh so uh look at this. Yeah. So\nyou've got Bitcoin 73 returning uh\nreturning uh by about 900 bucks there\noff the bottom. The cues are still\nstruggling to hold up honestly. You've\ngot Nvidia struggling.\nstruggle bus over here. Wow. Uh Disney.\nUh AMD. Oh, you recovered 200 there for\na moment. Wow. Uh that's good. That's\nreally important. What about Tesla?\nHow's Tesla holding up? Tesla. Oh, wow.\nWent to 399 there for a moment, huh?\nSome people got to buy with a three in\nthe front. That's cool. That's cool. Did\nI buy Tesla? No, I didn't buy Tesla.\nAll right. So,\nuh, let's see here. Oh, Chinese readout\nfrom their talk with Trump.\nUh, what is this?\nChina must safeguard its own\nsovereignty. We will never allow Taiwan\nto be separated. The US must handle the\nissue of arm sales to Taiwan with\nprudence.\nWould like to work together on bilateral\nties, blah blah blah. So, it's kind of\nlike, we want to work with you. We're\ngoing to say things are good, but you\nguys got to be careful sending weapons\nto Taiwan. Interesting.\nInteresting.\nOkay.\nWhat else? Uh,\nokay. So, now\nsomebody writes here, \"I got a cease and\ndesist from Binance. I really want to\nexpose everything I was told from\ncredible researchers, but I can't risk\nthe legal battle. Notice to cease and\ndesist.\nThis letter serves as a formal demand to\nimmediately cease and desist from\ndisseminating false inflammatory\nstatements regarding Binance. On\nFebruary 3rd, you posted on X that\nBinance is insolvent, responsible for\n1010 and the situation is far worse than\nthe FTX collapse. These claims are\ndemonstrabably false, malicious, and uh\nconstitute liable. Okay. So, slander\nbasically permanently delete post to\ncontent retraction. See all future\ndisparagement.\nWow.\nLooks like and this is what he wrote.\nLooks like the truth is unfolding and\nthe truth is coming out. Binance is\ninsolvent and they're solely responsible\nfor 1010. The effect it's having on the\nmarket is catastrophic. The news, if the\nnews I just received is real, we are\ntotally screwed.\nBut I mean, no, like it doesn't look\nlike he's provided any insights. I hate\nto feel like this guy, but people making\nsix figures just for streaming. CZ scam\npumping up hyperlquid competitor or or\nCZ scam. Multiple airdrops coming.\nPeople are saying we're just getting\nstarted. ETH at 4,500 sold back at 250.\nYeah, that was that's kind of up there,\nhuh? In terms of the numbers. What do I\nthink about Symbotic or anything? You\nknow, I haven't looked at Symbotic. I I\nshould do that. Going live tonight to\nshow all the receipts from reliable\nsources. Well, it looks like they wanted\nto uh stop that live stream, huh?\nAnd quickly send a cease and desist.\nYeah, interesting. All right, so let's\ngo back to Yeah, we're still on that\nuptrend here. Tesla's still on that\nuptrend. The Q's are trying, but boy,\nwhat a struggle to get this to move.\nLook at Snowflake down another 7%. It's\nshocking. Okay, let's go to the Iran\ndeal again here.\nYeah. Yeah. Michael Bur took I feel like\nmy spreadsheet and went a little bit\nmore extreme. So, I've been talking\nabout this. When did I make this? I made\na Bitcoin losses spreadsheet. I made\nthis\nin early December. So, this is from\nearly December. I made a Bitcoin losses\nspreadsheet and we estimated that the\ncurrent value at $85,000 how much these\ncompanies would have to indicate in\nlosses. So I suppose what we could do is\nwe could now update this for you know a\nFE 4 update and we could go in here and\nuh where's the math?\nOh, do I not have this as a formula?\nThat'd be annoying. Oh, I think I\ncalculated this on a different sheet and\ncopied it over. Oh, that's a bummer. All\nright. Well, what I could do is I could\nmagnify.\nWell, but you have to really base off\nwhat the loss is from\nJan 1, right? So, what you have to do is\nyou have to look at what the Jan 1 value\nis of Bitcoin because they report the\nloss quarterly, right? So, if I go to\nJan 1,\nJan one for Bitcoin,\nlet's see here.\nJanu\nwell December 31st December 31st closing\nprice was 87964\n87964 87964 87964 So Jan 1 value 87964\nOkay so\nJan one value Jan one value come on\ngen one value I think this computer is\nstarting to die just seizes up.\nOkay, now we're going to go. Where's\nSteve to tell me I need a Mac or Adele\nrather?\nSo, the Jan one value, we're going to go\nmultiply the outstanding Bitcoin.\nAlthough, they've bought more. So, this\nis a little dated.\nOh, I guess I could just put this here.\nThat's fine. That would work.\nOkay, that's the Jan one value. And then\nthe Feb 4 value at 70. I'll be generous.\nI'll call it $73,000, right? Uh would be\nthis times 73.\nAnd then this would be the loss\napproximate loss since Jan 1 through Feb\n4. This is going to be a formula\nof this minus this equals.\nThere we go. And now I should be able to\njust take all of these\nand copy paste down. Look at that. Here\nwe go. Fact check really quick.\nUh we've got 53,000\ntime\n87964\nis 46. Yeah. Okay. Perfect. Good. The\nvalues dropped quite a bit. So these are\nthe losses. So, for example, Micro\nStrategy is going to have to report $10\nbillion in losses if it stays at these\nprices, right? That's another $10\nbillion of losses. If I go to Coinbase,\nthey've got another $217 billion of\nlosses. Tesla has another $172 million\nin losses just from crypto. Uh, you\nknow, if it stays this way, you know,\nI've got GameStop over here at 70\nmillion bucks and their last income was\npro like boosted up. that was their Q3\nincome that was boosted up by uh by\nBitcoin gains, you know, now you've got\nthe opposite. So, so yeah, I mean, who\nknows? Maybe Michael Bur subscribes to\nthe channel. Uh cuz, you know, we've\nbeen talking about that for for a little\nbit.\nSo, uh anyway. Yeah. Okay. Somebody,\nwhat's this? Do you think we're in the\nbottoms? And when do you think you buy\nheavy?\nyou know, I mean, the time to really buy\nheavy, when you go out on margin and go\nbuy heavy is when you're in a recession,\nright? But then nobody has money. So,\nbut, you know, I don't think it's a\nforegone conclusion that we're going to\ngo into a recession. So, I, you know, I\nbought a little bit of the dip. I mean,\nyou saw I bought $22,000 or whatever of\na dip uh just now. You know, to me, I\nthink that's that's, you know, just a\nconservative little nibble uh on on a\nstock that, you know, I'm confident\nisn't going to get eradicated from AI.\nUh and I think there's a great\nopportunity in. But but anyway, um could\nbe wrong.\nSim, let's take a look at SIM. Wow.\nSim's down seven. You know, SIM really\nhas had a lot of trouble staying above\n64. That's been the challenge for\nSymbotic is it it just it can't stay\nabove 64. Uh and uh you know Walmart is\na big um purchaser of their product. Uh\nand Walmart is just I mean this is in\nlike almost like the flight to safety\nrecession stock right now. It's really\nincredible. But the valuation of Target\nrelative to sorry of Walmart relative to\nTarget is just insane. Insane regarding\nTesla. I'll watch my Tesla video. Based\non BTC, how based on how BTC has\nperformed in the past, it's probably\ngoing to go down until October,\nmaybe April at the soonest. Not looking\nat it again until the 54 to 47K range.\nYou know, somebody else here writes,\n\"What about the Scotas and tariff\nruling?\" Well, I mean, that's actually\nbullish for the stock market in the long\nterm, you know, that we that we are\nlikely to lose the AIPA tariffs. uh\nhowever that will create uncertainty in\nthe short term, hence this this\npotential, you know, Q1 drama that's\nthat's occurring right now. I mean, this\nis quite painful for for a lot of uh a\nlot of people. Uh you know, you're going\nto see a an eradication of of just\ncapital basically. Uh you know, it it's\none of the reasons why uh I I really\nlike right now uh how like looking at\nthe real estate we have. you know, we've\ngot what almost $70 million of of real\nestate that we've, you know, renovated\nuh and turned into beautiful homes and\nand so that's why I like, you know, I\nactually think real estate is is is is a\nperfect uh tool to have exposure for to\njust sort of minimize that u you know,\nwhat's it called? Um volatility in the\nstock market. You know, real estate\nhasn't moved uh to the downside like\nstocks have just recently removed. Uh\nwhat is this? Uh\nRed Fin. Let's go to Let's go to the\ndata center. Redfin data center.\nDownload housing market data. Let's just\nlook here. So let's go to like I don't\nknow. Let's go look at Austin, Texas.\nSee if they've recovered.\nSo Austin, Texas median sales prices\ncoming in comparison. See Austin's\nsomewhat stabilized, which is actually a\ngood sign. You know, Austin really\ntopped out in 2022, which they don't\neven show 2022 anymore, but you can see\nit's certainly lower than it was in\n2023, but you're you're starting to to\nconverge over here in Austin. So, Austin\nis finding a bottom, which is great. See\nhow San Francisco is doing. San\nFrancisco is at highs. Uh, so San\nFrancisco's up. How San Diego San Diego\nis up. Uh oh, here's the green. I should\nbe looking on this side. I'm looking at\nthe end of last year. They're up, but\nthe green is up as well. Uh let's try\nMiami.\nMiami, Florida. Miami is a little lower.\nUh uh nope, sorry. There's 2026. Miami\nis up as well. So, you know, real estate\nrelatively stable right now. And I mean,\nthis is not a real estate cycle uh or or\nyou know, cyclical crash for real\nestate. This is a uh this is an AI\nproblem. And real estate, you know, had\nits cycle in 2008. We're we're nowhere\nnear, in my opinion, a a a debt bubble\nin real estate. If anything, equity\npositions in real estate are very very\nresilient. You know, somebody left me a\ncomment the other day like, \"But Kevin,\nyou know, you said take out HELOCs at\nthe same time as you said don't take on\ndebt.\" I think people misunderstood when\nI said that. I'd like to just clarify. I\nthink it's a good idea to open a heliloc\nand don't use the debt because then you\nhave it as available. So if you go into\na recession, then you have the piggy\nbank ready to go, you know. Uh so yeah,\nthat's fun. How many properties house?\nYou know, we're coming up on 100 doors,\nwhich is kind of cool. Uh so we'll have\nto do something special when we hit 100,\nbut we might not hit 100. I mean, we\nmight build our way to 100, honestly,\nbecause uh I don't like buying outside\nof Q3, Q4, but we've got a lot of\ndevelopment in the pipeline. uh just\nwhat we're developing. We'll probably\nadd\num eight plus maybe\nfour or five over there. Uh plus maybe\nthree, we'll probably add about 16\nunits, you know, over the next uh year\nto two years. Uh that's just in build uh\nstuff that we're actually developing. So\nwe're also creating housing, right?\nThat's why I always think house is so\ninteresting because it's like, hey, we\nbuy fixer uppers, we buy and and place\ntenants after we fix them up, right? We\nalso develop real estate, but in\naddition to developing real estate, not\njust ADUs or new apartment buildings or\num land. We have a little bit of land as\nwell, pretty diversified. Um, you know,\nthen we're also doing software. So, I I\nI I'm personally just very excited about\nit all. Look at this. You are getting\nthis this turn up right here. Hopefully,\nwe could keep going up towards 607. It\nreally started around 1250 right here.\nLooks like we maxed out on on sellers\nand we're slowly getting some of that\nthat buy the dip.\nUh which is quite exciting.\nUh just for you know the SEC that's\nwatching remember there's risk with\nevery investment. Read the offering\ncircular before investing. 5% yield is\npaid through conversion. you get paid\nmonthly, whatever. It's really we're\npaying out mostly just our rents. Uh,\nokay. Tom Lee is responsible for\nbillions in pleb losses in Bitcoin and\nETH, but is a genius in bull markets\nwhen all ships rise the tide. Funst\nstrat do better. Am I still blocked?\nHey, you know, this is honestly an\nhonor.\nIs that an ad? Oh, yeah, that's an ad.\nThis is kind of an honor to me. Like I\nfeel like this is like a badge right\nhere, you know, this and Champ Champs\nback.\nAnyway,\nyeah, it's interesting for the all-in\npeople. I'm I I feel like part of me\ntell me if I should do this. You know\nwhat? I'll make a poll. Tell Tell me if\nthis is a good or a bad idea. We'll\nwe'll do a little poll. Uh, so I want to\ndo like\ntearown videos on the All-In podcast\nvideos because lately I feel like\nthey've gotten a little politicized.\nUh, and uh, so I was thinking about\ndoing tearown videos on on the All-In\nPod videos and um, what's actually kind\nof funny about that is I'm blocked by\ntwo of them. I am followed by one of\nthem and I'm not followed or blocked by\nthe fourth one.\nI got blocked by Chamoth for asking why\nhe paperhanded Virgin Galactic after\npumping it. Uh which, you know, to me\nlooked like a pump and dump. And then JC\nsays he wants to slice me to pieces\nbecause I on his real estate\nstartup that he invested in. He wasn't\nvery happy about that. Should I do tear\ndown videos on allin podcast? Yes. No.\nAll right. All right. I'm running the\npoll.\nWell, we'll we'll see what uh what what\nyou all think about that. Anyway, so I\nthink it's comedy.\nAll right. So, now\nOkay. So only popular central bank\nshould see history books last central\nbanks here abroad worked for decades to\nget inflation down to levels with price\nstability. We should not risk those hard\none gains. This is true for price\nstability. Uh-huh. Uh-huh.\nIntellectually at least today war\nappears to be the same as 2010. Yeah, I\nagree. He does seem like that. Oh, hold\non a sec.\nLet me let me download this right. I'll\ncome right back.\n>> Okay. One sec.\n>> Long-term revenue streams for the likes\nof Salesforce and so on. So,\n>> this move, Erin, though, is is a\nhistoric one. Um, what would you tell\ninvestors who are jumping out of these\nnames right now?\n>> Yeah. Well, well, I I I would rather\nmaybe keep it a little bit more\nphilosophical. So, um, uh, I I'd say\nthere's sort of two separate categories\nof of the conversation right now. The\nfirst is is what happens when AI coding\nallows you to develop, you know,\nsoftware at a at a hundth of the cost\nthat that you do today. um and what\nhappens to the maybe the pressure of of\nsome of these systems and do people go\nand code their own technology for a lot\nof these use cases. I I think for that\nit it somewhat misunderstands this idea\nof of where companies tend to spend\ntheir resources and their time and their\nenergy. And so, uh, a company wanting to\ntake on, uh, the average company wanting\nto take on its own project to manage its\nown ERP system or its own CRM system and\ntake on all of the risk, the liability,\nthe complexity of doing so, even if the\ncost of developing the software has gone\ndown by quite a bit. Um, I'm less sort\nof sympathetic to that that argument and\num, you know, I\n>> think that makes a lot of sense. I mean,\nyou gave the example of Ford recently.\nAnd I want you to continue the thought,\nbut I I think both of us who sit inside\ncompanies know\n>> they don't just goof off with software.\nThese are their most vital,\n>> most important business processes that\nthey have their maybe their entire\ncompany to understand how they work and\nthey have to be airtight. And I I just I\ncould see maybe for some startups or\npeople who are a little more sophistic I\njust don't understand how they're going\nto replace those workflows with\nsomething haphazard.\n>> Yeah. Correct. and and um you know I\nthink from from my perview and many many\npeers perviews I mean we we've lived in\na world of of things like open source as\nan example there's been open source CRM\nand ERP systems for decades and most\ncompanies don't run their entire sort of\nbusinesses on those because they don't\nwant to take the risk uh of having to\nmanage those systems themselves. They\nthey would rather rely on a vendor\nthat's seen that problem set 10,000\ntimes or 100,000 times and they built an\necosystem and they have a a set of\npartners that help you with that. So I\ndo think though that when you have a\nhundred times more software getting\nbuilt, I think that uh it's actually a\npositive boon because what will happen\nis the software vendors that have access\nto customers and that that are currently\nmanaging data or workflows, they're\ngoing to increasingly build more\nfunctionality for their customers. So I\nthink it's going to cause, you know, any\nexisting vendor that you have within\nyour technology stack to both have to\nearn their current dollars, but but\nultimately deliver more and more value\nfor you. Um, and I think that's going to\nbe an incredible uh time to be buying\nand using IT systems because you're\ngoing to get more and more value from\nyour software over time because we're\nall going to be building way more\nfeatures. So, I think you're going to\nhave more software, you're going to have\nmore functionality, you're going to have\nmore personalization of that. Uh, that's\nthe the sort of first part of the\nargument. The second though I think is\nmuch more exciting which is in a world\nof 10 or 100 or a thousand times more\nagents using technology than people do.\nI think the value of who has access to\nthe right data, the workflows that\nagents are involved in, the guard rails\nof protecting information and making\nsure again that agents only are working\noff of the right data. I think the value\nof these systems of record that are\ninvolved in critical mission critical\nworkflows, I think the value of those\nsystems will go up because agents are\ngoing to need access to all of that\ninformation if you want to go and and\ndrive any real automation in your\norganization. Um there's an interesting\nstat that Mike Kan Brooks uh the CEO of\nAtlassian shared I think on the last\nearnings call which is the customers\nthat they have that are using AI coding\nagents are growing faster than those\nthat aren't. And so just think about\nthat intuitively for a second. it it\nsort of makes sense. If you are going to\ngo deploy a h 100red times more coding\nagents than engineers you have in your\norganization, how are you going to keep\ntrack of what they're working on or what\nthey're doing or the tickets that they\nuh either filed or completed? The value\nof that system of record and the\nworkflow goes up as a result of that.\nSo, you know, I think some of the\ncognitive dissonance if you're inside of\nsoftware is we're actually seeing the\nuse cases for agents actually explode\nand then ultimately make these platforms\nmore useful and and more valuable. Yeah,\none side comment Brooke made an\nimportant one is that models like\nSnowflake and like don't charge\nper seat and so if that was a concern\nlike you said maybe there's more seats\nanyway. Quickly Erin with this broader\nmove that we're seeing in kind of tech\nand and and a little bit of this panic.\nUm I mean is there any word of caution\nyou'd add about what is ultimately\ndriving it? Does it does it feel to you\nlike something that's based on Yeah.\nClaude comes out. We just spoke to the\nlegal Zoom CEO. you know, they unleash a\nplugin for this and a plugin for that.\nAnd um it just a lot of these industry\nplayers and perhaps you would know\nbetter than us. Some of these smaller\nsoftware companies that might not be so\nvital where there they live. Maybe they\nlive in the private world. I don't know.\nBut maybe that's where you know more of\nthe pain is felt.\n>> Um I you know I think AI is is causing\nevery software company to have to stay\non its toes. uh it it is certainly\nforcing every every you know incumbent\nuh to make sure that they are doing more\nfor their customers. I think that's an\nincredible thing for the market and for\nIT buyers. Uh but again, you know, from\nfrom our purview, I'm sure from\nSalesforce's purview, from workdays or\nservice nows, in a world of of, you\nknow, again, agents running around\nworking across all of your data sets in\nyour business systems, the ability to\nensure that those agents only are\nworking on the right information, that\nthey're involved in workflows that are\ndeterministic, that can sort of stay on\nthe same rails every single time. The\nability to make sure that agents have\naccess to the right context. In our\nworld, that means enterprise content. uh\nthat actually is going to be even more\nimportant for agents to be doing the\nuseful work within our organizations.\nAnd so we look at something like Claude\nCo-work and we're incredibly excited\nbecause Box has an MCP connector that\nconnects directly into Claude Co-work,\nwhich means if you want to go and ask\nClaude Co-work to do, you know, some\ndata analysis for you or generate a\nPowerPoint presentation, it's able to\naccess all of the data in box to be able\nto go do that work. And so the ability\nto then control what does cloud have\naccess to uh what people is it able to\nwork with what data is it able to\ngenerate uh those become the really\nimportant elements of the future of\nbeing able to deploy AI agents. So uh\nwhether you have a data mode or a\nworkflow mode or a network effect within\nyour software I think these are going to\nbe very important attributes. Um but you\nknow I think the the conversation is\nvery healthy. I think we should be\nhaving conver\n>> Sorry about that. I got HVAC problem and\nI just had to help them really quick.\nOkay, that's done. So, uh, in the\nmeantime, I was listening to it at the\nsame time and the guy's talking about\nwhether you have a data flow, a data\nmode or workflow mode. I actually think\nthere are a lot of software companies\nthat have massive workflow modes. So, I\ntotally agree with that. A workflow mode\nwould be kind of like, as an example,\nI'm just going to think of one. Let's\nsay you have like a lot of people use\num, you know, what's what's that? What's\nthat mail app called? I hate it. But\nit's um Oh, what's the email app on\nMicrosoft? I don't know. Whatever. You\ngot all your crap set up in there.\nThere's there's like a barrier to leave\nthat, right? Or here's a better example.\nYou use QuickBooks to run payroll for\nyour employees. Everybody knows that\nsetting up payroll is a giant pain in\nthe double ass. It's and and now, you\nknow, AI can help enhance some of how we\nrun payroll or some of the work that we\ndo. And we really want to go set all\nthat up again. Like you're already\nintegrated in a flow at a company. It's\nlike, are you gonna use QuadBot to go\nscrew it up? No. Because they're going\nto pay the taxes for you. They're going\nto do the withholdings for you. They'll\ndeal with your tax letters for you. They\ndeal with all that crap for you. That's\na moat. You know, another Outlook. Gosh,\nyeah. Outcooked. Okay, I like that.\nThat's a good one. Outcooked. uh but um\nuh you know that's that's where I think\nyou know we have also a data moat in in\nhow I do wedge deals right like I don't\nthink people can take sort of the Kevin\nbrain and just replicate this because\nthe way we identify deals nationwide you\nremember in 2023 and 2024 we flew like\n500 hours that year exploring the\ncountry and testing sort of our wedge\ndeal model everywhere in the country\nlike those were foundations that we were\nbuilding back then with this physical\nintelligence that we think creates this\nmoat that companies in in real estate\ncan't compete with. Uh so but anyway,\nbut my whole point of bringing up that\nanalogy is just to say that I think that\nperson on the show there has a point. I\nagree with that. Uh okay. So this was\nabout war fiscal dominance. So what's\npersuaded Trump to pick this guy? Uh WH\nhas been conveniently concluded that\ninflation is no longer a threat. Right.\nRight. Right. So after being an\ninflation hawk, all of a sudden he's\nlike, \"Oh guys, you know, it's actually\nnot a problem anymore.\"\nWhich frankly,\nuh, you know, the the labor data\nprobably supports more rate cuts. Uh, so\nbut and Treasury yields have have\nremained aggressively high. Uh, so\nlet's see. At the same time, US Treasury\nis likely to shift further towards\nshort-term financing. Right. Okay. The\nresult might be another financial\ncrisis. Uh-oh. See, look at this. With a\nmore strongly upward sloping US yield\ncurve, the likely outcome would be\ngreater demand from dollar financing at\nthe short end. Right. So, more buying on\nthe 2-year and less demand at the long\nend. Correct. Correct. Yes. Yes. Yes.\nYes. Yes. Uh\nWars might be too far too willing to\nargue for whatever Trump wants.\nUh at the same time, Treasury will shift\ntowards short-term financing.\nUh because rates are high. So that makes\nsense. But that steepens the yield\ncurve. Given the decline in banks\nreserves and financial deregulation as\nwell, the balance sheet of the financial\nsector would become more fragile. Right?\nBank deregulation, which is why\neverybody wanted Trump. Wow. Imagine\nthat. Imagine deregulation causing a\ncrash cuz you deregulated everything and\nnow people go looney for private credit\nand AI and then wow, it's a bubble. The\nincentive to hold the dollar might fall\nas short rates decline and fears of\ninflation jumps jump. The result might\nbe another financial crisis. Correct?\nYes. W is a better candidate than many\nof the others, but he is confusing,\nperhaps confused, and the US would need\na Fed chair who would stand up to Trump.\nTo his credit, Powell has proved to be\nsuch a man. Will J. Wow, that's a good\narticle. Who wrote this? This was\nwritten by the Who's this guy? I don't\nknow who wrote it. This old guy. Not\nthere's anything wrong with being old.\nMarvin Wolf is a chief economics\ncommentator at the Financial Times.\nHonestly, it was that was a pretty good\npiece. Uh, I think this is a very\nlevel-headed piece and I agree. Let's\ntake a look at some of the comments. Two\nobservations. First, this man much like\nMartin who cares deeply about his\nstanding by leading across West. What is\nthis? This This to me looks like\nuh an AI written thing. I'm not reading\nyour AI slop. W did not get to where he\nis by being difficult or disagreeable.\nUh, his own family wealth depends on\nstaying on the right side of his\nfather-in-law who is a Trump ally.\nDoesn't it have to do with the uh is it\nEstee Lauder? I think it's Estee Lauder.\nUh, Kevin W. It's the wife, the wife's\ndad.\nSo, if you go here, uh, yep. Look at\nthat. Look at it. Look at it. Jane\nLauder, who is the daughter of Ronald\nLauder.\nRonald Lauder is the sole heir to Estee\nLauder companies.\nMan, hi Dad. Hello.\nSuch a grumpy photo.\nScary. Uh anyway, uh then\nlet's see here.\nUh blah blah blah. Okay, these these\ncomments are now going off of the rails.\nOkay, cool. So, that was the FT. Let's\ngo back to the doomers.\nSee what else they have for us. Okay,\nlet me close this poll. I'm going to\nclose this poll in 30 seconds. So, if\nyou want to vote, uh, make sure to go\ncheck that vote and then I'm going to\nclose it here. Software short sellers m\n$24 billion.\nWell, that's the thing and they have to\ncover, right? This is why when you get a\nbig drop like you get today on Palanteer\nor whatever, like at some point you want\nto take profits and so that's why you\ncan sometimes get these rebounds. I\nmean, I don't know. Let's see if it's\nsustaining. Yeah, it's still sustaining.\nSee that? Still sustaining up on the\ncues here. Slowly trying to get back up.\nBoy, oh boy. Uh, but Palanteer still in\nthe toilet. Tesla not as bad as it was\nbefore. And Microsoft App, Walt Disney,\nService Now, blah blah blah blah blah.\nOkay, so\nnot as bad as we had earlier. Let's go\ntake a look over here. Brutal run\nsoftware stocks has rattled investors\nacross Wall Street provided a boon to\nthose betting against the group. Yeah,\n$24 billion in paper gains per S3\npartners. Wow. Uh yeah, that's that's\nsomething else. Uh, okay. So,\nsoftware specific phenomenon, Mag 7\nessentially unchanged. I don't know if\nit's unchanged. You know, Tesla and\nNvidia are getting hit. Investors have\nbeen punishing software stocks for\nmonths about AI potentially hurting blah\nblah blah. I'm just excited we get to\nfinally I don't know. I mean, I'm glad\nwe did a little extension just to help\npeople out with the, you know, to get in\nbecause there were some people who felt\nreally bad they missed it. We did this\nlittle extension on the fundra for for\nhouse hack, but it's exhausting doing\nthe fundra. So that ends Friday. Two\nmore days. Two more days. Kevin,\nuh short interest in Microsoft has jump\nup 20% by the year. Gone up 10% for\nOracle. This marks a shift from the\ntypical moves short sellers make at this\npoint make at this point in a decline.\nWait, what? This marks a shift. Short\ninterest has jumped by 20% this year for\nMicrosoft, 10% for Oracle. Historically,\nsoftware companies behave like a\nreversal stock with shorts covering on\nthe way down. Right now, it's trading\nmomentum dist driven distressed name\nwith shorts increasing into weakness. Oh\nwow. Well, if the short selling\ncontinues to get worse,\nuh the whole selloff is going to get\nworse. You know, there'll be plenty more\nbuy the dip opportunities.\nWow, that's crazy.\nTesla avoids the AI panic. This is true.\nSoftware mogul's fortunes plunge by 62\nbillion. Will always support a strong\ndollar. Trump administration. We saw\nthis. We saw this. Uh Musk's AI startup\nis a payload SpaceX can't afford. Oh,\nthat's hilarious. I love that line. Uh I\nwant to I want to read this article\nabout SpaceX, but yeah, he's already\ngutted the Consumer Financial Protection\nBureau. This is true. Also, uh we did\nget um court's rule that he has to fund\nthe CFPB. So, I don't know what's going\nto happen there, but I didn't like that\nat all.\n>> Both to its flagship coding tools\nand\n>> worst possible timing to just go to the\nbathroom really quickly. I'm dying. All\nthe tea is going through me. I'm going\nto explode. Speaking of which, I'm going\nto make some more tea.\n>> One of the real exceptions recently has\nbeen the storage stocks with this whole\nidea of a of a shortage. The Microns,\nthe SanDisks of the world are falling\nout of bed today. SanDisk is down 15%.\n$101. Micron's down 12%, $51. So, this\nis just a broad cell tech situation, it\nsounds like.\n>> Absolutely. I mean, we've really been\nseeing uh SanDisk on a record tear. I\nmean, six straight days of gains to then\nsee a reversal today. I mean, this is a\nstock that's really been putting up some\nreally great numbers when we think about\nreturns this year. So, it's interesting\nto start to see that pullback, that\nreversal, not only in SanDisk, but\nreally just a widespread weakness that\nwe're seeing really ricocheting across\nthe tech industry more broadly.\n>> Yeah. All right. Well, let's talk about\ncrypto if we dare. My god. Uh we had a\n72 handle on Bitcoin a little while ago.\nIt's off the lows. We're at 73,850,\nstill down 3%. Are these tied together?\nBecause this has been a brutal couple of\nweeks.\n>> Certainly been a brutal couple of weeks\nwhen we take a look at cryptocurrencies.\nBitcoin in particular, Bitcoin today\nhitting its lowest level since 2024, but\nwe're really seeing about so many\ndollars, almost a trillion dollars\ncoming out. Half a trillion dollars\nbeing wiped out in this week alone when\nwe look at cryptocurrencies more\nbroadly. So, this plunge is really just\nraising a lot of doubts that have\nalready kind of been in the market, but\nreally being underscored right now about\nwhether or not Bitcoin's actually a safe\nhaven, especially when we think about\nall the geopolitical risks going on in\nthis environment. We've had Michael Bur\ncoming out to talk about it, throwing\nsome cold water on the scenario. We also\nhad Treasury Secretary Scott Besson\nearlier talking during a panel at the\nHouse panel today earlier during his\ntestimony saying that Bitcoin won't get\nany help from the Treasury. So, you're\ncertainly seeing a lot of money coming\nout of this this sector more broadly.\n>> I heard that exchange with Congressman\nBrad Sherman. Really interesting, Norah.\nThank you so much. Nora Minda is a\nawfully busy person in New York today\nand we thank you. Of course, one thing\nthat is moving higher is gold, right?\nEveryone calls Bitcoin digital gold.\nWell, actual gold is up just a fraction,\n$5 uh an ounce to 4908. We'll keep tabs\non all this for you. We're going to have\na lot to talk about late edition of\nBalance of Power once Alphabet reports\nafter the bell. important happenings as\nwe promised we'd be looking abroad\nbefore this hour was out and we want to\nkeep tabs on what's happening with Iran\nbecause this seems to be the story uh\nthat maybe no one's talking about for\nsome reason. We already told you that\nthe carrier strike group had arrived in\nthe region and you've been hearing some\nsaber rattling along with some promise\nof diplomacy and right now the secretary\nof state Marco Rubio says he's open to\nupcoming talks with Iran knowing that we\nhave a session planned for Friday and\nthat a location is being worked through.\nNow, he's a diplomat. Of course, that's\nhow that works. Take a look at the\nreporting from Axios. The US just told\nIran it will not agree to Thrron's\ndemands to change the location and\nformat of talks planned for Friday. They\nwanted everybody else out of the room.\nJust do this between Washington and\nThrron. That appears to be not\nhappening. The US and Iran had agreed to\nmeet in Istanbul\nwith other Middle Eastern countries\nparticipating as observers. We've been\nuh continuing our conversation with\nHeather Connley about this and she's\nback with us in studio now. Non-resident\nsenior fellow at the American Enterprise\nInstitute, the AEI, former Deputy\nAssistant Secretary of State for the\nBureau of European and Eurasian Affairs,\na voice of experience that we have drawn\non more than once. And Heather, it's\ngreat to see you. Welcome back. Is this\nthat happening?\n>> Okay, very interesting. So that's\nDoomberg for you. Let's go look at this\nfrom Doomberg. So this is uh from Tom\nBlack, opinion columnist. Uh what does\nhe say here about SpaceX? SpaceX had a\nbig, you know, I I I will say as a a a\nSpaceX shareholder in my venture capital\nfund, you know, we got in to the SpaceX\nvaluation, I think very uh well,\ndecently early. It was like in the 300\nmil uh um 300 billions. I mean, I guess\nthat's not like super early. Uh but uh\nyou know, now if it's going to IPO at\n15, that's still pretty damn good. Um,\nyou know, similar to the other\ninvestment we made into Appronic, uh,\nyou know, that that that is also I think\nthey're talking on $5 billion valuation,\nwhich is way higher than the one\nsomething we were in before. But anyway,\nuh, you know, as as essentially an\nexposed shareholder here to SpaceX, I\npersonally am bummed about this XAI buy.\nI don't like this. But anyway, uh so\nSpaceX has a big head start on\ntechnology which is drastically lower\ncost. And I talked about this\nacquisition in I think a video two days\nago I talked about how I didn't like\nthis. Uh you know just a quick tip by\nthe way if you watch my videos I know\nsometimes they're long. Um, I try to on\nthe long ones put a um, you know, little\ntabby at the bottom and explain,\nyou know, what's going on. So, like if\nyou zoom across, you can kind of see. I\ndon't remember where I said that, but\nsomewhere I was talking about SpaceX.\nOh, yeah. Here it is. And SpaceX.\n>> Yeah. Yeah. Yeah. See, so if you go into\nthis, for example, my Doom Loop video, I\ntalk about Nvidia, private credit,\nexplain the doom loop, which I think has\na really cool graphic to it. Uh, safety\nstocks, uh, and then SpaceX, you know,\nthe whole SpaceX section is this whole\nlike extra thing in the back right here.\nAnd, uh, you know, I don't know, maybe\nmaybe I should like separate those\nthings, but I don't. Anyway, uh SpaceX\nprepares for a two space Star Starship\nrocket to enter commercial service.\nNothing could derail the company from\nits leadership position except perhaps a\ntruly bad decision to chain a financial\nanchor around SpaceX's neck. It looks to\nbe the case with XAI. I Yeah. Yeah, I\nagree.\nUm Oh, I'm out of tea.\nOkay.\nHis cash gulping startup XAI the\ncombination 1.25 25 billion. Ignore the\ntalk about synergies with space. They\ndon't exist right now. SpaceX has been\ndoing fine at revolutionizing the space\nindustry with a Falcon 9 workhorse\nrocket. It enabled Russ Musk\nuh to build a Starlink constellation of\nlow Earth orbit satellites that provide\nmobile broadband internet for ships,\nplanes, recreational videos, roll homes,\nbattlefields, blah blah blah blah blah.\nYes, big fan, by the way, of Starlink\nand and all that. By the way, my Tesla's\nin service right now. And uh they're\nthey're doing some cool stuff to it.\nWell, they're they're fixing the fact\nthat it leaks, the tunnelout cover,\nwhich, you know, that's sad. Uh so\nthey're fixing the leak, but then on top\nof that, they're putting the off-roading\npackage underneath it. So, that's kind\nof cool. Uh and then they're fixing some\nother crap. So, got to wait for the dang\nthing to come back from service. Uh but\nanyway, uh then I can reinstall my\nStarlink on the back. That's where I was\ngoing with that. All right, so 165 mil\nmissions last year. That's like a launch\nevery other day. That's incredible. That\nwas also more than half of global\nlaunches. SpaceX is why the US is\ndominating the space race against China.\nOh, that's great. That's very bullish,\nright? SpaceX makes money charging\ncustomers by the ton to carry their\npayloads into space. But most of its\nlaunches were for Starlink last year,\nwhich is the main reason that SpaceX is\nprofitable,\nright? Totally makes sense. Customers,\nincluding United Airlines, blah blah\nblah. I love it. You know, I I've tried\nStarlink on planes before, and it's very\nimpressive. Uh I I never did get\nStarlink installed on mine, uh cuz the\nFAA certifications just took way too\nfreaking long, and I don't want another\nphone call from the FAA. Okay, I've\nalready had my share of phone calls.\nWell, I've had two phone calls from the\nFA. Um, nothing end ever ended coming\nout of them, but you don't want, you\nknow, it's kind of like the cops calling\nyou. You I don't want the cops called,\nyou know. Uh, I blame Jack for one of\nthem. He didn't wear his shoulder belt.\nCan you believe that? I I had a video of\nus flying and the FAA saw that Jack on\nmy video, the FAA saw that Jack wasn't\nwearing his shoulder belt. It's just the\nlap belt, which most planes just have\nthe lap belt. It's like, \"Oh, he should\nbe wearing a shoulder belt, you know,\nfor takeoff and landing.\"\nSo now I tell I always joke I'm like,\n\"Jack, if you don't wear a seatelt, the\nFAA is going to call daddy again.\"\nUh, it's crazy, but you know, they're\nwatching. I mean, good for good on them,\nI guess. Um,\nso\nanother thing that I thought was kind of\nfunny. Uh, and you should follow me on\nInstagram to see this kind of stuff. But\nthis morning, well, this was last night.\nI was dropping the mail off in my uh\ngo-kart. Uh, there it is. You could you\ncould watch that on XY yourself, but I I\nlike I go to the mail in my go-kart. Uh,\nlook at what we were watching on the way\nto school here. Or uh not watching, we\nwere playing wheels on the bus.\nAnd there they are.\nThat's why I was a little later this\nmorning with the live stream. Had to go\ndrop off the kiddos. But anyway, so uh\nlet's see. Flying Starlink. Okay.\nSpaceX, which produces own satellites,\nalso makes money. Government contracts\nmainly from NASA Defense Department will\nlikely play a key role\nuh in building out the Golden Dome. Oh,\nyeah. Okay, that's cool. So, let's see\nhere. The reliability.\nLast year, SpaceX earned a profit of 8\nbillion according to Reuters. 50% profit\nmargin is huge, especially for rockets.\nHonestly, that's fantastic, right?\nSo SpaceX just bought up a bunch of\nwireless spectrum to offer directly to\nphones. SpaceX or Starlight directly to\nphones, right? Unless Musk raids the\ncompany's cash to finance the startup,\nthat is. Or or to finance um XAI, right?\nUh so props to Jack for getting the FAA\ncalled on him. That's epic. Yeah. It's\nlike what 10 10-year-old gets the FAA to\ncall your dad on him?\nIt's a good point. Uh, the spending\nisn't easing up anytime soon. XAI\ncompetes with other deep pocketed tech\ncompanies and startups to acquire\ncomputer chips and build data centers to\nhouse them. Uh-huh. We know that SpaceX\nhas some competitors uh like Jeff Bezos,\nBlue Origins, and I haven't heard of\nthis one. Utilat\nCommunications\ncompetition. The actual AI product f\nfaces much more competition. That's\ntrue. OpenAI, Anthropic, Meta,\nMicrosoft, Alphabet. Too early to pick\nwinners and losers. The bottom line is\nXAI needs cash and Musk is looking at\nSpaceX as an ATM. This is deja vu all\nover again for Tesla investors who in\n2016 approved Musk's uh purchasing of\nSolar City. That was a smalish $2\nbillion deal that marked the beginning\nof Tesla's transformation into an EV\ncompany into a producer battery pack,\nsolar panels, and humanoid robots. Yeah,\nbut I mean in fairness, the battery\npacks and solar panels is a great\nbusiness.\nIn the end, Tesla's diversification may\nprove to be the smart move as Chinese\nelectric vehicles compete. True, SpaceX\ndoesn't need the diversification,\nthough. It's dominating the market. All\nthe AI companies will be lining up to\npurchase the special data center\nsatellites that SpaceX builds and the\nlowcost uh launch capacity provided by\nStarship. SpaceX is already seeking\napproval from the FCC to deploy an\norbital data center with up to a million\nsatellites. The plan is to position them\nin the sun-synchronous orbit that would\nbathe them in sunshine nearly 100% of\nthe time. Right. You sit right on the uh\nterminator zone is where it's called.\nThe terminator zone is this little belt\nthat always has sunshine in the sky. Uh\nit's it's it's very interesting.\nSomebody says, \"As a Tesla shareholder,\nI'm so happy he's tapping the Space X\npiggy bank instead.\"\nI mean, yeah, you're right. He should\nbe. Thank goodness it's not Tesla's free\ncash flow, huh? That's a good one. Uh,\nhurdle for a big data centers is the\ncost SpaceX doesn't need XAI to solve\nthis problem. Tesla would have been a\nbetter fit for XAI, says this person.\nHumanoid Optimus robot won't work well\nin factories unless it's agile AI.\nRight.\nYeah. Well, it's going to be a long\nshot.\nIt's an interesting point. The guy's got\na point. He's got a point. What company\nshould buy AMC? Meet Kevin run for\ngovernor should. You know, when I ran\nfor governor, I actually emailed Adam\nAaron and I'm like, \"Hey, let me do\nbecause there was a big movement around\nAMD at the time.\" I'm like, \"Dude, or\nAMC at the time. I'm like, \"Dude, let's\nuh let's have AMC's in California be the\nvenue for where we do, you know,\ngovernor uh you know, rallies.\" No\nreply. Like, all right, I get it. Maybe\nyou want to be apolitical, but I thought\nI thought it was a good idea. I mean,\nwe'd pay. We don't want it for free.\nWe're like totally willing to pay cuz\nthey weren't really showing anything\nanyway in 2021. It's tough time for the\nmovie theaters. Like, ah, maybe that'll\nhelp them out. Nope. It's all right. No\nproblem. Every no is a little closer to\na yes.\nUh so\nall right, where are the cues? Hey, look\nat that. We're finally above uh 2% here.\nWhat do we buy the dip? Like right over\nhere somewhere.\nSo uh you know, we've been watching a\nlittle bit of a recovery here. Tesla now\nonly in the 3s. Nvidia's in threes.\nLooks like we got a little bit of\nrelaxation here, which is good. Things\nare settling down a little bit. Netflix\nup 1.4. Good. Hopefully things uh keep\nrelaxing a little bit. You know, Meta\nstable, Google stable, that's going\nbankrupt. That's fine. We expect that.\nAny other deals out there?\nLook at him. $24.\nHoly moly. $5 on Pelaton.\nCoinbase down 7%. It's down at 167. Holy\nsmokes.\nLook at that decline from the summer.\nCoinbase 167 divided by 444. Coinbase is\ndown 62%.\nJeez.\nOh yeah.\nH what a mess. All right. Well, I got\nsome work to do for house hack. So, uh\n>> kiss him bye-bye.\n>> Yeah, I got some work to do. Appreciate\ny'all being here. Remember, go to meet\nKevin.com. You can join the alpha\nmembership. You get that alpha report\nevery morning before the market opens\nup. Uh, and then of course you get the\nfundamental analysis and the archive of\nfundamental analysis over at me.com. You\nwant the real estate AI, go to\nhousehack.com. Get that lifetime access\nbefore we switch to a monthly model once\nthe valuation AI comes out. You want to\ninvest in house hack, you could do that\nbefore Friday at 11:59 p.m. I can\nfinally close that and be done with it.\nAnd uh, read the offering circular.\nThere's risk with every investment. Good\nluck out there. I love you. I bought the\ndip. I hope you bought the dip, too.\nGoodbye and stay safe."}