{"videoId":"rImoL62xd5M","title":"Holy Sh*t | It's ACTIVELY Collapsing","publishedAt":"2026-01-29T16:20:39-08:00","transcript":"There is a critical chart that suggests\nour economy might be collapsing actively\nand the suits on Wall Street are deathly\nafraid about you finding out about these\ncharts. Starting with this one right\nhere, you've got to know about the\ndetails of exactly what's going on here\nbecause it's going to make sense of\neverything for you. This might be the\nmost important video we make on the\nchannel this year. Hey everyone, me\nKevin here. If you're wondering how to\ncombine all of the pain that happened\nwith not only Microsoft getting\nshellacked by 10% today, which is\nsomething you would really only find\nduring like a COVID crash or like a\ngreat recession style crash, Microsoft\nmassive company 10%\ndecline taking the entire software stack\nwith it. Mind you, you look at Service\nNow or Snowflake or really any other\nkind of software company today, absolute\nshellacking.\nWhat happened and why are these\ncompanies getting beat up? What does it\nhave to do with this chart? And how does\nall of it linked together with private\ncredit and ironically a company like\nFacebook, you know, Meta going up 10%\ntoday? Well, this chart explains all of\nit and we're going to link everything\ntogether and break it down for you in\nthis video. So, subscribe to the\nchannel, buckle up, and let's get into\nit. First, we have to start with the\nbaseline of what has been funding the\ncore of our economic growth over the\nlast few years. We know that the normal\neveryday consumer isn't benefiting from\nthe best economic data ever. As Donald\nTrump tells us, those are the headline\nnumbers that are really boosted by\nartificial intelligence. And a lot of\nthat spending is driven by private\ncredit. Private credit, we know has\nstarted to roll over, but so far Wall\nStreet banks are telling us, \"Guys,\ndon't worry. It's these are just\nindividual little frauds. It's all\nfine.\" And maybe that's true. Maybe\neverything is fine. I mean, quick recap.\nThe same day Charlie Kirk died, it's\nterrible. We ended up having collapse.\nOh, but they were spreadsheet\nfraudsters. 3 weeks after that, First\nBrands and auto, you know, an auto\nprovider of things like windshield\nwipers and auto parts collapsed just a\nfew weeks later. And then now they're\nindicting the founder as of today for\nfraud. So, I guess maybe that was just\nfraud, too. And then I guess the\ncollapse of Sonder Homes or Spirit or\nRenovo Home Loans or many other\ncompanies including Black Rockck's very\nown private credit fund that got written\ndown 19% or oh I I don't know maybe\nApollo writing down $170 million of\nprivate credit to zero literally 2 days\nago. May maybe all of that is just\nidiosyncratic, which you know is a\nreally fancy way of saying, \"Oh, well,\nthose are just unique to their own\nlittle companies.\" But you can't really\nsay idiosyncratic and believe it without\nthinking idiot if you believe it.\nThere's something else going on here.\nAnd so when PIMCO gives us a warning\nlike this, a firm that manages $2.3\ntrillion. $2.3 trillion. This is like a\nJP Morgan size of company. When they\ngive us a warning and start saying\nthings like, \"Hey, um, we might actually\nhave serious problems here that people\naren't paying attention to.\" It's often\ntimes not just time to start paying\nattention, but often already too late.\nBecause a lot of these big firms, they\ndon't want to say things are bad because\nthen things get worse. But they do\neventually want to tell you things are\nbad because that way they can tell you\nthey told you so. It's Ca so they get\nsued less. Anyway, maybe I'm just jaded,\nyou know. Call me call meet Kevin that\njaded guy on YouTube. Anyway, look at\nthis. Private credits hidden hazards.\nPIMCO president warns investors are\nturning a blind eye to mounting risks as\nproblems from loans from the zero rate\nera come due. This is really a fancy way\nof saying there's refinancing risk and a\nlot of these private credit funds have\nbeen throwing money at artificial\nintelligence. That's what we're about to\nhit. That's why there's a warning about\nsector concentration. It's artificial\nintelligence. And then of course we get\nlimited disclosure, limited\nmarktomarkets, right? We saw Blue Owl is\nseeing this exodus of investors. Blue\nOwl is a company that's throwing money\nat Meta's data centers for them. They're\ntaking on the debt risk financing these\ndata centers and artificial intelligence\nexpansions and people are fleeing them.\nI multiple times a day I feel like I'm\nseeing articles about Blue Owl investors\ntrying to bail out to whatever limit\nthey can get out. uh and that they are\nseeing the largest exodus that we have\nseen since really the creation of\nprivate credit in this last boom since\nthe great financial crisis. It's a\nproblem. But what does all of that have\nto do with those original charts? That\nfirst blue chart I showed you showing\nthis sort of peeking out line. Well,\nfrankly, everything here it is. AI or\nartificial intelligence adoption rates\nhave started to flatten out across all\nfirm sizes. So this on the left side\nhere on the Y ais shows you the\npercentage of new firms entering into\nartificial intelligence. So in other\nwords, if you're a firm and you're like,\n\"All right, boys and girls, it's finally\ntime to pick up, you know, tighten our\nboots or tighten the belts a little bit\nand strap the boots on and and adopt\nthis AI thing.\" You know, companies were\ngrowing. We saw a lot of this since the\nGPT moment and more and more companies\nare like all right it's finally time to\nadopt AI that period of time has now\nstarted to shrink or see fewer companies\nmaking those decisions this means the\naggregate or total number of companies\nhas started to flatline because you're\ngetting fewer companies coming in saying\nwe need to adopt AI so if you take a\nlook at this artificial intelligence\nadoption rates have started to flatten\nout across all firm sizes\nWhat you find is really an S-curve here.\nGPT moment. The early easy adopters kind\nof like the first people who adopt full\nself-driving like me in 2017 making\nYouTube videos. Guys, I'm on autopilot\non the highway. This is the coolest\nthing since sliced bread. Leave me a\ncomment if you were watching my videos\nback then. But anyway, now you go\nthrough this era of early adopters to\neuphoria where a lot of people are\nadopting and then you get the slowdown\nperiod where you got half of companies\nto adopt and the other half are like,\n\"Ah, AI hallucinates too much or AI\nsucks anyway. We don't need to use that\ncrap anyway.\" Right? Those are the hard\nones to get. That's like getting grandpa\nto get into a self-driving car. Okay?\nIt's going to take a lot more effort to\nget these folks to adopt artificial\nintelligence.\nThis is a massive problem because all of\na sudden when artificial intelligence\nadoption rates flatten out, what does it\nmean for the entire sector of AI which\nis boosting our entire economy which is\nboosting private credit? Well, it\npotentially means that AI investment\nmight start petering out. And if AI\ninvestment starts looking like it's\ngoing to peter out, then private credit\nis going to start petering out. And if\nprivate credit starts petering out, then\nAI investment continues to peter out.\nIt's a doom loop. When and it doesn't\nmatter which one came first, the chicken\nor the egg in this case, private credit\npetering out or AI petering out. Now,\nyou could have a private credit crisis\nthat starts making funding harder for\nAI, even though we're still trying to\nboom in AI, and you still go down\nbecause it's a doom loop. When one\nfails, private credit or AI, doesn't\nmatter which one starts. When one starts\nfaltering, they both start faltering.\nAnd that's when you start seeing what I\ncall bailins from companies like Nvidia,\nwhich you're going to see in this video.\nCompanies to OpenAI or XAI, which you're\nalso going to see in this video, then\nyou start really scratching your head\ngoing, \"Uh-oh, what's going on here?\" So\nit's not just these charts though. Take\na look at this. Those were firmwide\ncharts. AI adoption though for\ngenerative artificial intelligence work\nat work essentially right has flatlined.\nThis chart goes all the way back to\nAugust of 2024. And you can see the\nlines for share using Gen AI use Gen AI\nlast week use Genai Gen AI every day\nlast week have flatlined. So, it's not\nlike the people who were using it just\nonce a week all of a sudden are using it\nevery day last week or the people who\nare using Gen AI are all of a sudden\nalso using it last week. We're not\nreally seeing a movement there. We're\nseeing flatlining. Flatlining is bad.\nKind of like you go into a hospital,\nTHEY'RE LIKE, \"OH, FLATLINING. CRASH\nCARD. HE'S CRASHING.\" The crash car come\nin. The defibrillator comes clear.\nKind of trying to, you know, get it up\nagain. Okay. we're trying to, you know,\nsometimes people have a hard time or\nindustries have a hard time getting it\nup and then we got to help them out a\nlittle bit and then hopefully\neverything's fine or it's a sign of a\nlarger problem. And that's the problem\nhere is if you go to the very next\nslide, you can see how has your firm's\nuse of artificial intelligence affected\nyour firm. And well, you could see that\nthe vast majority of companies here\nabout 69% report no change. Otherwise,\nyou've got really nominal responses.\nYou've got just as many people saying\nthat artificial intelligence has\nessentially combined here either\ndecreased their productivity by 1 to 5%\nor more than 5%. If you combine those\ntogether you're roughly equaling the\nincrease of more than 5% group over\nhere. Uh and then of course you do have\nthis increase of 1 to 5% but you know\nreporting companies that's really only\nsomewhere between 15 to 25%. So in other\nwords, this bucket right here on net is\nthe bucket that's really driving\nartificial intelligence. Otherwise, a\nlot of people are reporting, I don't\nknow, it helps a little bit, but is it\nreally at that level where it's doing as\nmuch as we're being promised? Maybe not.\nNow, I personally think we're in myself,\nmy real estate startup, we're somewhere\nover here in this high value ad task and\nand we're seeing massive productivity,\nbut we also study and work artificial\nintelligence on a daily basis. I mean,\nafter all, we're a real estate\nartificial intelligence software as a\nservice startup. You can learn more\nabout that at househack.com or reinvest\nsame company. I just invested another\nmillion dollars of my personal money on\nmy birthday just yesterday into my own\nreal estate intelligence software\nintelligence company because we're\nlooking going, \"Wow,\nwe have a really bright future.\" That's\nour opinion, right? This isn't a\nsolicitation for you. If you want to\ninvest in that, go to houseack.com, but\nread the offering circular. This is just\na way of saying I'm really optimistic\nabout what we're seeing with artificial\nintelligence, but that's not the point\nof this video. See, I could be really\noptimistic about what we're doing with\nartificial intelligence, but that\ndoesn't matter for private credit or all\nthe companies taking on debt. We don't\ntake on debt. We don't care. But all the\nother companies taking on debt and\nrelying on private credit, they need\neveryone to be like, \"Oh my gosh, I got\nto have more AI.\" And it's like, you go\nto, you know, you go to Cold Stone,\nyou're like, \"I got to have it.\" That's\nwhat companies like Microsoft rely on.\nAnd in a moment, you're going to see the\ndifference between Microsoft and\nartificial intelligence or and Meta. And\nthis is actually a really critical\ndistinction that could also help your\ninvesting future. So, pay attention to\nthis distinction because it's going to\nbe huge. Now, something else that could\nalso help your investing future is well,\nthis this is a exact print up of our\nalpha report that I sent out this\nmorning about 30 minutes before the\nmarket opened up. And I want to show you\nthis because you could learn something\nfrom this alpha report. And then we're\ngoing to show you actual statistics.\nJust know if you want to get this alpha\nreport yourself, I'm making a very\nspecial because of this video and the\nshellacking that just happened extension\nof our coupon code bday at meet\nkevin.com to Friday at 11:59\np.m. Yesterday was my birthday. We had a\nschlacking in markets today as I went on\nvacation. So, we're going to extend that\ncoupon code to 11:59 p.m. and then\nthere's going to be a big price increase\non the product. So, if you want to get\nlifetime access for these alpha reports\nI send every day the market is open,\ncheck it out at mekevin.com. But let's\ntake a look at the insights on the alpha\nreport this morning exactly the way I\nposted it. There it is. 129 2026 alpha\nreport. I set this at about 6 a.m. this\nmorning. I wrote uh yesterday bleed out\ntowards Powell. Nailed it. Hopefully you\nwere able to stay safe because we talked\nabout all that yesterday. It was just a\nsort of a quick recap like what did we\nget right, what did we get wrong from\nthe day before. critical today. I wrote,\n\"The more I study Microsoft, the more\npissed I get. 7 billion of their net\nincome came from OpenAI as a liquidation\nvalue adjustment.\" H over 40% of their\nRPOS, we'll talk about that in just a\nmoment, are just from OpenAI. More the\nmore exposure companies have to OpenAI,\nthe riskier they are. Meta does not have\nthis issue. who I wrote and so I wrote\ntherefore I also said by the way Tesla\nis gutting itself of what it's done well\nto fund the unknown and I had some\ncomments about this so I wrote that my\nopinion today was the move was the\nfollowing watch the first 5 to 15\nminutes if Microsoft tanks in the first\n5 minutes which has more risk than Tesla\nwe're probably going down to 428 which\nif you look at the chart is exactly what\nhappened today. I forecast that this\nwill though lead Microsoft to go down to\nunder $400 by midFebruary. Giving away\nsome alpha here. I also wrote in this\ncase, Oracle has more downside and the\nupside on chip plays stays limited,\nwhich Oracle sold off as much as 5 to 6%\nintraday and then all of a sudden the\nchip plays, they were pretty flat and\nstable, but again upside capped just\nlike what we wrote. And so my warning\nwas if institutions are selling\nMicrosoft, we're bearish the Q's today.\nWe were green when I wrote this on the\ncues when I wrote this report and we\ntanked. I wrote that Tesla if the Q's go\ndown might follow Microsoft down and it\ndid. I do also write that this is not\ntrying to be bearish on the entire\neconomy. If OpenAI craters, that's bad.\nWe're far from that at this point. But\nwe've got to be watchful. And the\nwatchfulness is what I want to show you\nin this video because after this alpha\nreport released, we got these charts\nfrom Apollo Credit. Now, why is that\ninteresting? Apollo Credit is literally\nthe firm that just wrote down over\n$und00 million of private credit losses,\nwriting over $und00 million down to zero\nbecause of artificial intelligence and\nprivate credit. But that's interesting\nbecause they're also the ones putting\ntogether these charts. Well, some of\nthem and this data, which then makes me\nwonder, maybe they're trying to secretly\nlet us on to something. So, here's\nanother chart from Apollo. Are\nproductivity gains flattening? Percent\nof hours saved as a share of hours\nworked in the previous week. In November\nof 2024, we thought we were saving about\n1.4 hours per week. Then we went to 1.6.\nThen we went to 1.8, now 1.7. The gains\nhave stopped and we're now actively in\nreversal. Now, this is survey data, so\nit could be unreliable, but Microsoft's\ndata is actually proving the point. In\nfact, we reported this on Microsoft in\nthe fourth quarter that Microsoft had\nsome engineers leak that Microsoft was\nstarting to lower sales targets for some\nof their generic artificial intelligence\nagents products. And see, if generic\nartificial intelligence agents were\nreally capable of replacing enterprise\nsoftware, that would be really great for\nMicrosoft.\nBut they had to lower their quotas cuz\nthey can't get people to stick. This was\nan early warning sign that there were\nproblems at Microsoft.\nAnother problem about the entire\nartificial intelligence stack,\nunfortunately, is that companies like\nMicrosoft and Meta keep blowing more and\nmore money on artificial intelligence.\nFacebook, for example, Meta just\nannounced that they're spending 13% more\nin capex in 2026 for artificial\nintelligence than we thought they were\ngoing to. We thought they were going to\nspend about $110 billion this year.\nThey're actually going to spend\nsomewhere between well midpoint\nsomewhere around $125 billion.\nAnd there's an upside part to that range\ntoo, which is wild. But if you look at\nthis chart, you can see the capex as a\npercentage of GDP today is actually way\nhigher, the yellow bar, than what we saw\nin the 2000.com\nbubble of telecom companies.\nOops. It means this spending we're doing\nis even more drunk and loony than\ncompared to the.com bubble which is\nsomewhat scary. So let's understand why\nKevin is Meta doing so well, Microsoft\ndoing so poorly and what does all this\nhave to do with OpenAI and XAI? Ah well\nhere you go. Microsoft told us the\nfollowing. Microsoft in their earnings\ntold us that gaming, search and\nadvertisements were soft. Those are core\nbusiness items that aren't related to\nartificial intelligence. Now, co-pilot\nseat was seat growth was great, up 160%\nyear-over-year. But the problem is,\nremember the charts earlier where we see\n69 67ish% of people aren't seeing\nproductivity from artificial\nintelligence at work. That's not good\nfor more co-pilot adoption, especially\nas people think that companies like\nMoltbot, formerly Claudebot or Anthropic\nand their actual Cloud product are kind\nof kicking co-pilot's butt. You know,\nyou open up claude.com now, they try to\ngive you like, use Claude in Excel,\nbasically saying don't pay Microsoft,\npay us instead. Now, that could be\nidiosyncratic or there are risks to the\nentire industry. And you might have a\nfeeling of where I'm going here. But\nremember this for a moment. Microsoft is\na little exposed. When I say a little, I\nshould be saying a lot because co-pilot\nrequires that users sign up for the\nproduct and renew the product. Microsoft\nsigns a lot of three-year deals, which\nmeans we're about to hit a massive\nrenewal cycle for enterprise co-pilot\nadoption in 2026 and 2027, which is 3\nyears after 2023 GPT release uh and\nintegration into Copilot and 2024\neuphoric ramp. And if companies aren't\nreporting productivity gains from\nartificial intelligence, we have a\nreally big problem, especially compared\nto other businesses that don't rely on\nthat kind of adoption. Now, we'll talk\nmeta, but before we do, what's the nail\nin the coffin for Microsoft when it\ncomes to artificial intelligence\npotentially not being as productive as\nresearchers are finding for the vast\nmajority of people? Again, I find AI\nproductive. Maybe you do as well, but\nmaybe we're unique and and and we forget\nthat. Who knows? But take a look at\nthis. Microsoft tells us they have $625\nbillion of remaining performance\nobligations. Of those, 40% are open AI.\n$250 billion of revenue Microsoft is\ntelling us there is they're going to get\nis coming directly from Open AI. only\n$30 billion is coming from Anthropic and\n345 billion is coming from other Azure\ncommitments. This is actually a real\nproblem for Microsoft because Microsoft\nis telling us, oh well the, you know,\nthe reason things slow down is because\nwe just don't have a place to put all\nthese server chips. Uh, and because\nwe're not able to put all these server\nchips everywhere. Well, I mean, that's\nwhy, you know, we can't plug them in.\nThat's why Azure is growing slower. And\nand if we actually had a place to put\nall these chips, we'd be able to grow\nquicker. So, we're just running out of\nroom to pull out all the chips, right?\nBut your RPO concentration used to be\nmassively diversified to thousands of\ndifferent countries or companies around\nthe world. Now, 40% is in the hands of\njust one company, Open AI. Now, why is\nthat a problem? Well, it's a problem\nbecause OpenAI, we know this, we've been\ncovering this on the channel regularly.\nOpenAI burns money hand over fist. Open\nAAI is a company that isn't expected to\nactually generate a profit likely until\n2030, at least according to some\nresearchers. Some say, \"Oh, no, they'll\nbe profitable sooner. They'll be\nprofitable maybe in uh 2029, but\ncertainly not until then.\" Okay. Either\nway, this is problematic because it\nmeans that OpenAI needs money to\nactually be able to pay Microsoft.\nBut that cycle creates issues of well\nperpetual hopes that AI would actually\nbe useful for people. And as a result,\nto try to keep these hopes going, we're\nseeing our first bailin. Take a look on\nscreen here. We are seeing current talks\nof a $100 billion mega round, the\nbiggest AI fund raise in history for\nOpen AI. Amazon in talks to invest it uh\ninvest up to $50 billion into OpenAI.\nSoft Bank up to $30 billion. Nvidia up\nto $30 billion. Microsoft somewhere\naround $10 billion in addition to pump\nup OpenAI to give them cash to keep the\ncycle of spending going even though\nwe're seeing productivity\nslow down. Now this is somewhat\nproblematic because the same thing is\nhappening at companies that provide\nservices to OpenAI like Coreef. Think\nabout this for a moment. OpenAI is\nburning money like crazy, not seeing the\nenhancements we're hoping to see at\nMicrosoft. So, both of them are\nsuffering. And so, it's no surprise that\na data center company or a Neocloud like\nCororeweave is also seeing problems.\nCoreweave is a company that saw its\nstock drop over 64%\nat a low in December of 2025.\nNow, it's since recovered a little bit,\nbut you should ask yourself, why did\nCororeweave recover a little bit? Watch\nthis. Coreweave recovered in December\nbecause of the following. On December,\nwell, in January, actually. On December\n31st, Cororeweave is on fumes for cash.\nI wrote on X, you can follow me there at\nRealme Kevin or on Instagram at me\nKevin. I post there pretty much daily.\nTake a look at this. Corre is on fumes\nfor cash and announces new loan terms\nthat allow unlimited equity cures for\nany failure to satisfy debt service. In\nother words, Cororeweave is so badly\nrunning out of money trying to provide\nservice to companies like OpenAI so they\ncan keep paying Microsoft that they're\nbegging the lenders to give them\nexceptions. And they're basically\nsaying, \"Hey, you know, if if we could\nget somebody to bail us out or bail us\nin by investing more money into us, is\nit okay if you know, we screw up some of\nour loan terms?\" And the banks are like,\n\"Well, if we say no, we're screwed\nanyway, so yeah, I I guess it's okay.\"\nAnd so what happens just three and a\nhalf weeks later on January 26th, Nvidia\ninvests $2 billion into Core at $87 per\nshare to prop up Cororeweave.\nNothing to see here. Just like the\nprivate credit issues. It's all\nidiosyncratic. It's all just these\nindividual companies. They had little\nhiccups. You know, Cory had trouble\npouring concrete in Texas cuz, you know,\nit got a little cold and a little rainy.\nSo, so they didn't want to pour the\nconcrete, you know? I mean, come on. And\nif they poured the concrete, then\nMicrosoft could have plugged in the GPUs\nand then Nvidia wouldn't have as many\nGPUs in inventory and it would all be\nfine.\nBut see, that's what people, much like a\nperpetual motion machine, get wrong\nabout artificial intelligence. Take a\nlook on screen here. Artificial\nintelligence is this promise of\nperpetual motion, or at least the\ninvestments that we're seeing. This,\nhey, Nvidia is going to generate chips.\nMicrosoft is going to plug them in.\nOpenAI is going to do the inference for\nus and the training for us and and\nCorewave is going to help hold some of\nthese chips, whatever, right? They all\nhave their different ser services and\npurposes that they serve. You know,\nAzure over at Microsoft or Coreweave\nproviding the the leasing of the GPUs or\nthe renting out or the sale of whatever,\nright? The idea is that as long as the\nmoney keeps flowing, it's fine.\nBut the thing that people forget in this\ninfinite money loop is perpetual motion\ndoesn't exist. If you create a loop of\nwater, let's say, and you're like, \"Oh,\nI could have energy forever. I've solved\nperpetual motion.\" Everybody's thought\nabout that as a kid, like, \"Why wouldn't\nthis work?\" Well, it's because there's\nthis thing called friction. Friction\nkills motion. Nvidia throws cash at\ncompanies like OpenAI that are burning.\nI mean, this here says $5 billion per\nyear. That's a dated number. They're\ncurrently probably burning somewhere\nbetween 19 to 48 billion per year. But\nwe don't have that full color because\nwell it's a private company and you know\nthat's that's hidden. That's a lack of\ndisclosure like what PIMCO warned about.\nUh you know Microsoft isn't seeing a lot\nof ROI for like 67% of their users on\nC-pilot. At least that's what firms are\nsaying per Apollo\nand Coreweave can't even pay their\nfreaking debts. So they're breaching\ntheir covenants. All this stuff creates\ncash burn, lower adoption, funding\nstress, and loss. Eventually, the\nperpetual motion machine stops. And why?\nBecause friction always wins. Circular\nfunding schemes don't work. Because in\nthe long term, cash burn always takes\nover and bankruptcy ensues. It's not\ngood. The only question is when does the\nmusic stop? Right? Like I wrote in my\nalpha report. Remember you can get that\nat me.com. Use that extension code. When\ndoes it stop\nor where do you go in the meantime? Do\nyou just say who cares? Let's go\nsomewhere else in the meantime. We're\ngoing to talk about that somewhere else\nand Meta and some other stocks in just a\nmoment. But the fact that you have to\nremember is this isn't just open AI.\nThis is also Elon Musk's XAI. Take a\nlook at what I call virus takeover stage\none. XAI has drained capital from all of\nthese different companies. Black Rockck,\nFidelity, they've taken the Twitter\nrevenue, Cisco, Valor, A16, Andre Snor,\nuh Tesla, they've taken $2 billion from.\nThey've taken money from SpaceX. They've\ntaken money from Nvidia. They've taken\nmoney from a lot of different companies\nto fund Elon Musk's version of GPT.\nThat's stage one is suck in all this\nmoney because just like OpenAI, they got\nto keep sucking in money to keep this\ncycle going. Got to use nice words here.\nBut what comes after this sort of\nfeeding frenzy where, you know, they get\ntwo billion, then 20 billion, then 10,\nthen six, then six, now you know, or\noriginally 135. I read this upside down.\n$135 million originally, then six, then\nsix, then 10, then 20, then two from\nTesla, right? All of this, oh, SpaceX\nshould frankly be on here as well. All\nof this money flowing into XAI for a\nmoney losing business to keep artificial\nintelligence propped up so Elon can win\nhis personal vendetta against Sam Alman.\nBut what happens next? Well, this tells\nyou how bad the bailin is. Not only do\nwe have a hundred billion dollars\npotentially getting raised to bail in\nOpenAI where existing investors are\nthrowing in more money going, \"Oh no,\ncrap. We need to save this and keep the\ncycle going.\" Elon's doing the same\nthing, but Elon hasn't made as many\nfriends as Sam Alman. So Elon\ngets a bailin from himself. Elon at XAI\ncalls up Elon at Tesla. Hey yo, I need\ntwo bill. How are we going to do it? Oh,\nuh the more shareholders voted no uh on\non on acquiring XAI shares if we include\nthe abstensions. Uh well, let's just\nlet's just redefine it. Let's not count\nthe abstensions as nos and let's just\ncount the yes votes uh and we'll call it\na pact. Can I get my two $2 billion now?\nYeah, sure. Here's a $2 billion. So Elon\nnegotiates with himself to get money\nfrom Tesla. Even though the normal way\nthe Tesla board decides,\nyou know, when when you count\nabstensions, it's voted as or it's\ncounted as a no where we don't want to\ninvest in XAI. That's the normal way.\nEven though that normal way says no,\nTesla's not going to invest in XAI. Now\nyou got Elon going, oh guys, well, you\nknow, since the vast majority of you\nwanted to invest in XAI, we're going to\ndo it cuz he needs the money. But that's\nnot enough. So then Elon's got to pick\nup the phone again and go, \"Hey Elon, at\nSpec Space SpaceX, yeah. Uh, can we\nmerge uh into SpaceX because you're\ngoing to IPO and that's going to give us\npublic liquidity for this massive money\nlosing business.\" So what do we have\nhere? Stage two, the infection spreads.\nThe parasite breaches the crown jewel.\nXAI, the money destroying virus, gets\ninto SpaceX. SpaceX, a company that\ngenerates profitability from Starlink,\nover $20 billion in government\ncontracts. You've got billions of\ndollars in space launches, revenue\nthat's exploded from some of their older\nlevels, including their valuation that's\nexploded. I'm a venture capital investor\nin SpaceX. You know, our venture capital\nfirm is probably up three plus three 3\nto 4x on our SpaceX investment. So,\ndon't get me wrong, I love SpaceX, but I\ndon't like this money destroying virus\npotentially coming in to screw up the\nSpaceX IPO.\nBut that's what's happening. Why?\nBecause if it doesn't happen, the virus\nis going to self-destruct. It needs\nanother host to suck money from. So, why\nnot attach itself to a business that has\nbeen built for 23 years and generated\nover $800 billion of market cap,\npotentially as much as $ 1.5 trillion.\nWhy not attach yourself and leech from\nthat? That's exactly what Elon is doing.\nAnd so this is where when we broadly\nlook at what's going on in the\nartificial intelligence space, we should\nbe really concerned. And in my opinion,\na lot of companies with exposure to\nartificial intelligence seats, this\nwould be uh like a co-pilot where you've\ngot essentially a wrapper around some\nkind of AI product, are potentially\nfacing really big renewal risks. Now, I\ndo think a lot of babies are getting\ntaken out with the bathwater here. Like\nService Now's numbers are pretty good.\nUiPath is a fantastic example of a\ncompany that's getting absolutely\nbattered because of this idea that you\nknow any company that sells seats even\nlike an Adobe is going to get destroyed\nby artificial intelligence. You know\nUiPath is an interesting one. I mean\njust look on screen here. UiPath, in my\nopinion, has this unique moat because\nit's something that like a moltbot can't\ncompete with because they provide to\nabout 900 enterprise customers\ngovernance, audit trails, compliance,\nreliability. They're used in healthcare,\nHIPPO regulations, financial services,\ngovernment, insurance, consulting. You\ngot to have accuracy. So, UiPath is\nactually a really cheap play, but it's\nprobably at risk of more downside\nbecause, well, frankly, right now\neverybody's selling everything software.\nAnd so, that brings us to Meta. Is Meta\npotentially a better play in this\nenvironment? And why is Meta doing so\nwell? Well, as we've been sort of\nhinting from the beginning of the video,\nMeta is very different from Microsoft.\nLook at this. Meta, according to JP\nMorgan, is likely to see their revenue\ngrow 30%.\nAnd what's unique about Meta's revenue\nis they're not actively relying on you\nrenewing your co-pilot subscription.\nMeta makes money from you enjoying\ncontent on Instagram or Facebook, reels,\nstories, whatever.\nthe more they can convert you to buy\nstuff by feeding you what you want to\nsee using the benefits of artificial\nintelligence by feeding you the right\nstories, the right posts to keep you on\nthe platform, by feeding you the right\nads to convert you more likely, which is\nexactly what's happening. Their\nconversion rates at different parts of\nthe business are all skyrocketing\nanywhere on the low side of 3% increases\nin conversion rates year-over-year to as\nhigh as 24% increases in conversion\nrates. Watch time year-over-year is up\n30% at Meta. This is a business that has\nfigured out how to keep you glued on the\nplatform, whether it's Instagram or\nFacebook. Same's probably said about Tik\nTok, though. You know, you got some\nquestions there. I guess now we're\ncensoring Epstein and everything related\nto Epstein because that doesn't align\nwith the Trump administration, but\nwhatever. Trump administration also\nwants everybody's retirement account to\nthrow money into private credit because\nthe suits on Wall Street need some\nmoney.\nAnyway, knock on wood. we don't never\nget censored over here on YouTube. So,\nwe can keep freely talking about uh\nthese these sort of topics. But Meta is\nan interesting one because AI enhances\nMeta's existing revenue without\nrequiring seats or subscriptions or new\nadoption. They just keep showing stuff\nto people on that that are vertically\nscrolling and buying stuff, which is\nbasically every single consumer in\nAmerica. Users don't have to learn\nartificial intelligence or how to use\nC-Pilot or how to use all the features\nin GPT. It doesn't matter. There's no\nrenewal risk either because advertisers\npay for results, not seats. And there's\nreally just this transactional, hey,\npeople are getting impressions and\nhopefully they're clicking and buying\nour product. This is a totally different\nbusiness. And for well, frankly months,\nI've been saying that Meta looks pretty\ndang cheap. And so to me, it's not a\nhorrible surprise that Meta had this\nvery nice skyrocket. and it's a stock\nthat we've been talking about quite a\nwhile uh on the channel and in the\ncourse member live streams. But all of\nthis together creates a really\ninteresting bottom line.\nEconomically,\naggregate data tells us the economy is\ndoing fine.\nBut if private credit continues to slow\ndown, then the whole AI ponzi flows, you\nknow, it all flows down. It all cycles\ndown into the toilet. We're going to\nkeep getting little adrenaline shots.\nThat's what we're getting right now.\nOkay. This hundred billion dollars to\nOpenAI adrenaline shot. The money to XAI\nthat Tesla gave them uh or you know is\ngoing to potentially come from the IPO.\nLittle adrenaline shots. But those\nadrenaline shots won't last forever. And\nthat's exactly why you've got to be\ncautious in this market. Educate\nyourself on a daily basis. Diversify.\nIncrease cash. Ignore the people like,\n\"Oh, but Kevin, the dollar is losing\nvalue. If you have cash, you're losing\nvalue.\" No, no, no. That's foreign\nexchange. That matters if you go, you\nknow, buy stuff from Europe or you're\ngoing to go fly to Europe on a vacation.\nOtherwise, cash is a call option on\neverything. And if your cash is yielding\n3, four, 5% or whatever, then you have\noptionality above the rate of inflation\nanyway. So, it's really less of a\nproblem. Anyway, if you like this\npresentation, consider what we do over\nat meetke.com. Join that alpha report.\nWe've extended that to 11:59 tomorrow.\nIf you want, you can bundle it up with\nthe real estate artificial intelligence\nthat we do over at househack.com.\nI'm going to go enjoy my vacation and\nhopefully tomorrow we get a little bit\nof a rebound in markets so cooler heads\ncan prevail. Otherwise, the carry trade\non wide is about to accelerate."}